axfnull/N32G401_CodeLib/firmware/CMSIS/device/n32g401f8s7_1.h
/**
*     Copyright (c) 2022, Nations Technologies Inc.
* 
*     All rights reserved.
*
*     This software is the exclusive property of Nations Technologies Inc. (Hereinafter 
* referred to as NATIONS). This software, and the product of NATIONS described herein 
* (Hereinafter referred to as the Product) are owned by NATIONS under the laws and treaties
* of the People's Republic of China and other applicable jurisdictions worldwide.
*
*     NATIONS does not grant any license under its patents, copyrights, trademarks, or other 
* intellectual property rights. Names and brands of third party may be mentioned or referred 
* thereto (if any) for identification purposes only.
*
*     NATIONS reserves the right to make changes, corrections, enhancements, modifications, and 
* improvements to this software at any time without notice. Please contact NATIONS and obtain 
* the latest version of this software before placing orders.

*     Although NATIONS has attempted to provide accurate and reliable information, NATIONS assumes 
* no responsibility for the accuracy and reliability of this software.
* 
*     It is the responsibility of the user of this software to properly design, program, and test 
* the functionality and safety of any application made of this information and any resulting product. 
* In no event shall NATIONS be liable for any direct, indirect, incidental, special,exemplary, or 
* consequential damages arising in any way out of the use of this software or the Product.
*
*     NATIONS Products are neither intended nor warranted for usage in systems or equipment, any
* malfunction or failure of which may cause loss of human life, bodily injury or severe property 
* damage. Such applications are deemed, "Insecure Usage".
*
*     All Insecure Usage shall be made at user's risk. User shall indemnify NATIONS and hold NATIONS 
* harmless from and against all claims, costs, damages, and other liabilities, arising from or related 
* to any customer's Insecure Usage.

*     Any express or implied warranty with regard to this software or the Product, including,but not 
* limited to, the warranties of merchantability, fitness for a particular purpose and non-infringement
* are disclaimed to the fullest extent permitted by law.

*     Unless otherwise explicitly permitted by NATIONS, anyone may not duplicate, modify, transcribe
* or otherwise distribute this software for any purposes, in whole or in part.
*
*     NATIONS products and technologies shall not be used for or incorporated into any products or systems
* whose manufacture, use, or sale is prohibited under any applicable domestic or foreign laws or regulations. 
* User shall comply with any applicable export control laws and regulations promulgated and administered by 
* the governments of any countries asserting jurisdiction over the parties or transactions.
**/

/**
*\*\file n32g401f8s7_1.h
*\*\author Nations
*\*\version v1.0.0
*\*\copyright Copyright (c) 2022, Nations Technologies Inc. All rights reserved.
**/ 
#ifndef __N32G401F8S7_1_H__
#define __N32G401F8S7_1_H__

#ifdef __cplusplus
extern "C" {
#endif


/***  N32G401F8S7_1_Library_Basic ***/

#if !defined USE_STDPERIPH_DRIVER
/** Comment the line below if you will not use the peripherals drivers.
   In this case, these drivers will not be included and the application code will
   be based on direct access to peripherals registers **/
#define USE_STDPERIPH_DRIVER
#endif

/** In the following line adjust the value of External High Speed oscillator (HSE)
   used in your application

   Tip: To avoid modifying this file each time you need to use different HSE, you
        can define the HSE value in your toolchain compiler preprocessor.  **/
#if !defined HSE_VALUE
#define HSE_VALUE (8000000) /* Value of the External oscillator in Hz */
#endif                      /* HSE_VALUE */

/** In the following line adjust the External High Speed oscillator (HSE) Startup
   Timeout value **/
#define HSE_STARTUP_TIMEOUT ((uint16_t)0x1200) /* SYSCLK= 72M Time out for HSE start up */
#define HSI_STARTUP_TIMEOUT ((uint16_t)0x02D0) /* SYSCLK= 72M Time out for HSI start up */
#define LSI_STARTUP_TIMEOUT ((uint16_t)0x02D0) /* SYSCLK= 72M Time out for LSI start up */

#define HSI_VALUE (8000000) /* Value of the Internal oscillator in Hz */

#define __N32G401F8S7_1_STDPERIPH_VERSION_MAIN (0x00) /* [31:24] main version */
#define __N32G401F8S7_1_STDPERIPH_VERSION_SUB1 (0x04) /* [23:16] sub1 version */
#define __N32G401F8S7_1_STDPERIPH_VERSION_SUB2 (0x00) /* [15:8]  sub2 version */
#define __N32G401F8S7_1_STDPERIPH_VERSION_RC   (0x00) /* [7:0]  release candidate */

/** N32G401F8S7_1 Standard Peripheral Library version number **/
#define __N32G401F8S7_1_STDPERIPH_VERSION                                                                                    \
    ((__N32G401F8S7_1_STDPERIPH_VERSION_MAIN << 24) | (__N32G401F8S7_1_STDPERIPH_VERSION_SUB1 << 16)                               \
     | (__N32G401F8S7_1_STDPERIPH_VERSION_SUB2 << 8) | (__N32G401F8S7_1_STDPERIPH_VERSION_RC))

/** Configuration of the Cortex-M4 Processor and Core Peripherals **/
#ifdef N32G401F8S7_1
#define __MPU_PRESENT 1          /* N32G401F8S7_1 devices does not provide an MPU */
#define __FPU_PRESENT 1          /* FPU present */
#endif                           /* N32G401F8S7_1 */
#define __NVIC_PRIO_BITS       4 /* N32G401F8S7_1 uses 4 Bits for the Priority Levels    */
#define __Vendor_SysTickConfig 0 /* Set to 1 if different SysTick Config is used */


/*** N32G401F8S7_1 Interrupt Number Definition ***/

typedef enum IRQn
{
    /** Cortex-M4 Processor Exceptions Numbers **/
    NMI_IRQn              = -14, /* 2 Non Maskable Interrupt                             */
    HardFault_IRQn        = -13, /* 3 Hard Fault Interrupt                               */
    MemoryManagement_IRQn = -12, /* 4 Cortex-M4 Memory Management Interrupt              */
    BusFault_IRQn         = -11, /* 5 Cortex-M4 Bus Fault Interrupt                      */
    UsageFault_IRQn       = -10, /* 6 Cortex-M4 Usage Fault Interrupt                    */
    SVCall_IRQn           = -5,  /* 11 Cortex-M4 SV Call Interrupt                       */
    DebugMonitor_IRQn     = -4,  /* 12 Cortex-M4 Debug Monitor Interrupt                 */
    PendSV_IRQn           = -2,  /* 14 Cortex-M4 Pend SV Interrupt                       */
    SysTick_IRQn          = -1,  /* 15 Cortex-M4 System Tick Interrupt                   */

