axfnull/N32G401_CodeLib/firmware/CMSIS/device/n32g401f8s7_1.h
    /** N32G401F8S7_1 specific Interrupt Numbers  **/
    WWDG_IRQn             = 0,  /* Window WatchDog Interrupt                            */
    PVD_IRQn              = 1,  /* PVD through EXTI Line16 detection interrupt          */
    RTC_TAMPER_STAMP_IRQn = 2,  /* EXTI Line18 interrupt                                */
    RTC_WKUP_IRQn         = 3,  /* RTC global Interrupt                                 */
    FLASH_IRQn            = 4,  /* FLASH global Interrupt                               */
    RCC_IRQn              = 5,  /* RCC global Interrupt                                 */
    EXTI0_IRQn            = 6,  /* EXTI Line0 Interrupt                                 */
    EXTI1_IRQn            = 7,  /* EXTI Line1 Interrupt                                 */
    EXTI2_IRQn            = 8,  /* EXTI Line2 Interrupt                                 */
    EXTI3_IRQn            = 9,  /* EXTI Line3 Interrupt                                 */
    EXTI4_IRQn            = 10, /* EXTI Line4 Interrupt                                 */
    
    DMA_Channel1_IRQn    = 11, /* DMA Channel 1 global Interrupt                      */
    DMA_Channel2_IRQn    = 12, /* DMA Channel 2 global Interrupt                      */
    DMA_Channel3_IRQn    = 13, /* DMA Channel 3 global Interrupt                      */
    DMA_Channel4_IRQn    = 14, /* DMA Channel 4 global Interrupt                      */
    DMA_Channel5_IRQn    = 15, /* DMA Channel 5 global Interrupt                      */
    DMA_Channel6_IRQn    = 16, /* DMA Channel 6 global Interrupt                      */
    DMA_Channel7_IRQn    = 17, /* DMA Channel 7 global Interrupt                      */
    DMA_Channel8_IRQn    = 18, /* DMA Channel 8 global Interrupt                      */    
    ADC_IRQn             = 19, /* UADC global interrupt                               */
    MMU_IRQn             = 20, /* MMU global interrupt                                */
    RESERVE21_IRQn       = 21, /* CReserved Interrupt                                 */
    EXTI9_5_IRQn         = 22, /* External Line[9:5] Interrupts                       */
    
    TIM1_BRK_IRQn        = 23, /* TIM1 Break Interrupt                                 */
    TIM1_UP_IRQn         = 24, /* TIM1 Update Interrupt                                */
    TIM1_TRG_COM_IRQn    = 25, /* TIM1 Trigger and Commutation Interrupt               */
    TIM1_CC_IRQn         = 26, /* TIM1 Capture Compare Interrupt                       */
    TIM2_IRQn            = 27, /* TIM2 global Interrupt                                */
    TIM3_IRQn            = 28, /* TIM3 global Interrupt                                */
    TIM4_IRQn            = 29, /* TIM4 global Interrupt                                */    
    I2C1_EV_IRQn         = 30, /* I2C1 Event Interrupt                                 */
    I2C1_ER_IRQn         = 31, /* I2C1 Error Interrupt                                 */
    I2C2_EV_IRQn         = 32, /* I2C2 Event Interrupt                                 */
    I2C2_ER_IRQn         = 33, /* I2C2 Error Interrupt                                 */
    SPI1_IRQn            = 34, /* SPI1 global Interrupt                                */
    SPI2_IRQn            = 35, /* SPI2 global Interrupt                                */
    UART1_IRQn           = 36, /* UART1 global Interrupt                              */
    USART2_IRQn          = 37, /* USART2 global Interrupt                              */
    RESERVE38_IRQn       = 38, /* Reserved Interrupt                               */
    EXTI15_10_IRQn       = 39, /* External Line[15:10] Interrupts                      */
    RTCAlarm_IRQn        = 40, /* RTC Alarm through EXTI Line Interrupt                */   
    LPTIM_WKUP_IRQn      = 41, /* LPTIM_WKUP through EXTI line 20 interrupt            */
    TIM8_BRK_IRQn        = 42, /* TIM8 Break Interrupt                                 */
    TIM8_UP_IRQn         = 43, /* TIM8 Update Interrupt                                */
    TIM8_TRG_COM_IRQn    = 44, /* TIM8 Trigger and Commutation Interrupt               */
    TIM8_CC_IRQn         = 45, /* TIM8 Capture Compare Interrupt                       */    
    UART4_IRQn           = 46, /* UART4 global Interrupt                               */
    TIM5_IRQn            = 47, /* TIM5 global Interrupt                                */
    TIM6_IRQn            = 48, /* TIM6 global Interrupt                                */  
} IRQn_Type;

#include "core_cm4.h"
#include "system_n32g401f8s7_1.h"
#include <stdint.h>
#include <stdbool.h>

typedef int32_t s32;
typedef int16_t s16;
typedef int8_t s8;

typedef const int32_t sc32; /* Read Only */
typedef const int16_t sc16; /* Read Only */
typedef const int8_t sc8;   /* Read Only */

typedef __IO int32_t vs32;
typedef __IO int16_t vs16;
typedef __IO int8_t vs8;

typedef __I int32_t vsc32; /* Read Only */
typedef __I int16_t vsc16; /* Read Only */
typedef __I int8_t vsc8;   /* Read Only */

typedef uint32_t u32;
typedef uint16_t u16;
typedef uint8_t u8;

typedef const uint32_t uc32; /* Read Only */
typedef const uint16_t uc16; /* Read Only */
typedef const uint8_t uc8;   /* Read Only */

typedef __IO uint32_t vu32;
typedef __IO uint16_t vu16;
typedef __IO uint8_t vu8;

typedef __I uint32_t vuc32; /* Read Only */
typedef __I uint16_t vuc16; /* Read Only */
typedef __I uint8_t vuc8;   /* Read Only */
typedef enum
{
    RESET = 0,
    SET   = !RESET
} FlagStatus,INTStatus;

typedef enum
{
    DISABLE = 0,
    ENABLE  = !DISABLE
} FunctionalState;

#define IS_FUNCTIONAL_STATE(STATE) (((STATE) == DISABLE) || ((STATE) == ENABLE))

typedef enum
{
    ERROR   = 0,
    SUCCESS = !ERROR
} ErrorStatus;


/*** Analog to Digital Converter ***/

typedef struct
{
    __IO uint32_t STS;
    __IO uint32_t CTRL1;
    __IO uint32_t CTRL2;
    __IO uint32_t SAMPT1;
    __IO uint32_t SAMPT2;
    __IO uint32_t JOFFSET1;
    __IO uint32_t JOFFSET2;
    __IO uint32_t JOFFSET3;
    __IO uint32_t JOFFSET4;
    __IO uint32_t WDGHIGH;
    __IO uint32_t WDGLOW;
    __IO uint32_t RSEQ1;
    __IO uint32_t RSEQ2;
    __IO uint32_t RSEQ3;
    __IO uint32_t JSEQ;
    __IO uint32_t JDAT1;
    __IO uint32_t JDAT2;
    __IO uint32_t JDAT3;
    __IO uint32_t JDAT4;
    __IO uint32_t DAT;
    __IO uint32_t DIFSEL;
    __IO uint32_t CALFACT;
    __IO uint32_t CTRL3;
    __IO uint32_t SAMPT3;
} ADC_Module;

/*** AFEC ***/

typedef struct
{
    __IO uint32_t TRIMR0;       /* offset 0x00 */
    __IO uint32_t TRIMR1;       /* offset 0x04 */
    __IO uint32_t TRIMR2;       /* offset 0x08 */
    uint32_t RESERVED0;         /* offset 0x0C */
    uint32_t RESERVED1;         /* offset 0x10 */
    uint32_t RESERVED2;         /* offset 0x14 */
    __IO uint32_t TRIMR3;       /* offset 0x18 */
    uint32_t RESERVED3;         /* offset 0x1C */
    __IO uint32_t TESTR0;       /* offset 0x20 */
    __IO uint32_t TESTR1;       /* offset 0x24 */
} AFEC_Module;

