axfnull/N32G401_CodeLib/firmware/CMSIS/device/n32g401f8s7_1.h
#define DBG ((DBG_Module*)DBG_BASE)


/**** Peripheral Registers_Bits_Definition ****/


/*** CRC calculation unit ***/

/** Bit definition for CRC_CRC32DAT register **/
#define CRC32_DAT_DAT ((uint32_t)0xFFFFFFFF) /* Data register bits */

/** Bit definition for CRC_CRC32IDAT registerr **/
#define CRC32_IDAT_IDAT ((uint8_t)0xFF) /* General-purpose 8-bit data register bits */

/** Bit definition for CRC_CRC32CTRL register **/
#define CRC32_CTRL_RESET ((uint8_t)0x01) /* RESET bit */

/** Bit definition for CRC_CRC16CTRL register **/
#define CRC16_CTRL_LITTLE   ((uint8_t)0x02)
#define CRC16_CTRL_BIG      ((uint8_t)0xFD)

#define CRC16_CTRL_RESET    ((uint8_t)0x04)
#define CRC16_CTRL_NO_RESET ((uint8_t)0xFB)


/*** Power Controller ***/
/** Bit definition for PWR_CTRL register **/
#define PWR_CTRL_LPS        ((uint16_t)0x0001) /* Low-Power Deepsleep */
#define PWR_CTRL_PDS        ((uint16_t)0x0002) /* Power Down Deepsleep */
#define PWR_CTRL_CLRSTBF    ((uint16_t)0x0008) /* Clear Standby Flag */
#define PWR_CTRL_PVDEN      ((uint16_t)0x0010) /* Power Voltage Detector Enable */

#define PWR_CTRL_PLS        ((uint16_t)0x00E0) /* PLS[2:0] bits (PVD Level Selection) */
#define PWR_CTRL_PLS_0      ((uint16_t)0x0020) /* Bit 0 */
#define PWR_CTRL_PLS_1      ((uint16_t)0x0040) /* Bit 1 */
#define PWR_CTRL_PLS_2      ((uint16_t)0x0080) /* Bit 2 */

#define PWR_CTRL_DBKP       ((uint16_t)0x0100) /* Disable Backup Domain write protection */
#define PWR_CTRL_MSB        ((uint16_t)0x0200) /* Bit 9 */
#define PWR_CTRL_CLRWKUP    ((uint16_t)0x0800) /* Clear PA0 wakeup Flag */
#define PWR_CTRL_CLRRTCWKUP ((uint16_t)0x2000) /* Clear Standby Flag */

/** Bit definition for PWR_CTRLSTS register **/
#define PWR_CTRLSTS_STBYF     ((uint16_t)0x0002) /* Standby Flag */
#define PWR_CTRLSTS_PVDO      ((uint16_t)0x0004) /* PVD Output */
#define PWR_CTRLSTS_WKUPF     ((uint16_t)0x0010) /* PA0 wakeup Flag */
#define PWR_CTRLSTS_WKUPRTCF  ((uint16_t)0x0040) /* RTC wakeup Flag */
#define PWR_CTRLSTS_WKUPEN    ((uint16_t)0x0200) /* Enable PA0_WKUP pin */
#define PWR_CTRLSTS_WKUPRTCEN ((uint16_t)0x0800) /* Enable RTC wakeup */
#define PWR_CTRLSTS_WKUPPS    ((uint16_t)0x2000) /* Wakeup polarity for PA0 */

/** Bit definition for PWR_CTRL2 register **/
#define PWR_CTRL2_STOP2S    ((uint16_t)0x0001) /* Enable STOP2 */
#define PWR_CTRL2_SRSTBRET  ((uint16_t)0x0004) /* SRAM standby mode retention  */
#define PWR_CTRL2_LSITRIM   ((uint16_t)0x01F0) /* config the LSI trimming value */
#define PWR_CTRL2_IWDGRSTEN ((uint16_t)0x0400) /* Enable IWDG RST WakeUp */


/*** Reset and Clock Control ***/

/** Bit definition for RCC_CTRL register **/
#define RCC_CTRL_HSIEN   ((uint32_t)0x00000001) /* Internal High Speed clock enable */
#define RCC_CTRL_HSIRDF  ((uint32_t)0x00000002) /* Internal High Speed clock ready flag */
#define RCC_CTRL_HSITRIM ((uint32_t)0x000000F8) /* Internal High Speed clock trimming */
#define RCC_CTRL_HSICAL  ((uint32_t)0x0000FF00) /* Internal High Speed clock Calibration */
#define RCC_CTRL_HSEEN   ((uint32_t)0x00010000) /* External High Speed clock enable */
#define RCC_CTRL_HSERDF  ((uint32_t)0x00020000) /* External High Speed clock ready flag */
#define RCC_CTRL_HSEBP   ((uint32_t)0x00040000) /* External High Speed clock Bypass */
#define RCC_CTRL_CLKSSEN ((uint32_t)0x00080000) /* Clock Security System enable */
#define RCC_CTRL_PLLEN   ((uint32_t)0x01000000) /* PLL enable */
#define RCC_CTRL_PLLRDF  ((uint32_t)0x02000000) /* PLL clock ready flag */

/** Bit definition for RCC_CFG register **/

/** SCLKSW configuration **/
#define RCC_CFG_SCLKSW   ((uint32_t)0x00000003) /* SCLKSW[1:0] bits (System clock Switch) */
#define RCC_CFG_SCLKSW_0 ((uint32_t)0x00000001) /* Bit 0 */
#define RCC_CFG_SCLKSW_1 ((uint32_t)0x00000002) /* Bit 1 */

#define RCC_CFG_SCLKSW_HSI ((uint32_t)0x00000000) /* HSI selected as system clock */
#define RCC_CFG_SCLKSW_HSE ((uint32_t)0x00000001) /* HSE selected as system clock */
#define RCC_CFG_SCLKSW_PLL ((uint32_t)0x00000002) /* PLL selected as system clock */

/** SCLKSTS configuration */
#define RCC_CFG_SCLKSTS   ((uint32_t)0x0000000C) /* SCLKSTS[1:0] bits (System Clock Switch Status) */
#define RCC_CFG_SCLKSTS_0 ((uint32_t)0x00000004) /* Bit 0 */
#define RCC_CFG_SCLKSTS_1 ((uint32_t)0x00000008) /* Bit 1 */

#define RCC_CFG_SCLKSTS_HSI ((uint32_t)0x00000000) /* HSI oscillator used as system clock */
#define RCC_CFG_SCLKSTS_HSE ((uint32_t)0x00000004) /* HSE oscillator used as system clock */
#define RCC_CFG_SCLKSTS_PLL ((uint32_t)0x00000008) /* PLL used as system clock */

/** AHBPRES configuration */
#define RCC_CFG_AHBPRES   ((uint32_t)0x000000F0) /* AHBPRES[3:0] bits (AHB prescaler) */
#define RCC_CFG_AHBPRES_0 ((uint32_t)0x00000010) /* Bit 0 */
#define RCC_CFG_AHBPRES_1 ((uint32_t)0x00000020) /* Bit 1 */
#define RCC_CFG_AHBPRES_2 ((uint32_t)0x00000040) /* Bit 2 */
#define RCC_CFG_AHBPRES_3 ((uint32_t)0x00000080) /* Bit 3 */

#define RCC_CFG_AHBPRES_DIV1   ((uint32_t)0x00000000) /* SYSCLK not divided */
#define RCC_CFG_AHBPRES_DIV2   ((uint32_t)0x00000080) /* SYSCLK divided by 2 */
#define RCC_CFG_AHBPRES_DIV4   ((uint32_t)0x00000090) /* SYSCLK divided by 4 */
#define RCC_CFG_AHBPRES_DIV8   ((uint32_t)0x000000A0) /* SYSCLK divided by 8 */
#define RCC_CFG_AHBPRES_DIV16  ((uint32_t)0x000000B0) /* SYSCLK divided by 16 */
#define RCC_CFG_AHBPRES_DIV64  ((uint32_t)0x000000C0) /* SYSCLK divided by 64 */
#define RCC_CFG_AHBPRES_DIV128 ((uint32_t)0x000000D0) /* SYSCLK divided by 128 */
#define RCC_CFG_AHBPRES_DIV256 ((uint32_t)0x000000E0) /* SYSCLK divided by 256 */
#define RCC_CFG_AHBPRES_DIV512 ((uint32_t)0x000000F0) /* SYSCLK divided by 512 */

/** APB1PRES configuration */
#define RCC_CFG_APB1PRES   ((uint32_t)0x00000700) /* APB1PRES[2:0] bits (APB1 prescaler) */
#define RCC_CFG_APB1PRES_0 ((uint32_t)0x00000100) /* Bit 0 */
#define RCC_CFG_APB1PRES_1 ((uint32_t)0x00000200) /* Bit 1 */
#define RCC_CFG_APB1PRES_2 ((uint32_t)0x00000400) /* Bit 2 */

#define RCC_CFG_APB1PRES_DIV1  ((uint32_t)0x00000000) /* HCLK not divided */
#define RCC_CFG_APB1PRES_DIV2  ((uint32_t)0x00000400) /* HCLK divided by 2 */
#define RCC_CFG_APB1PRES_DIV4  ((uint32_t)0x00000500) /* HCLK divided by 4 */
#define RCC_CFG_APB1PRES_DIV8  ((uint32_t)0x00000600) /* HCLK divided by 8 */
#define RCC_CFG_APB1PRES_DIV16 ((uint32_t)0x00000700) /* HCLK divided by 16 */

/** APB2PRES configuration **/
#define RCC_CFG_APB2PRES   ((uint32_t)0x00003800) /* APB2PRES[2:0] bits (APB2 prescaler) */
#define RCC_CFG_APB2PRES_0 ((uint32_t)0x00000800) /* Bit 0 */
#define RCC_CFG_APB2PRES_1 ((uint32_t)0x00001000) /* Bit 1 */
#define RCC_CFG_APB2PRES_2 ((uint32_t)0x00002000) /* Bit 2 */

#define RCC_CFG_APB2PRES_DIV1  ((uint32_t)0x00000000) /* HCLK not divided */
#define RCC_CFG_APB2PRES_DIV2  ((uint32_t)0x00002000) /* HCLK divided by 2 */
#define RCC_CFG_APB2PRES_DIV4  ((uint32_t)0x00002800) /* HCLK divided by 4 */
#define RCC_CFG_APB2PRES_DIV8  ((uint32_t)0x00003000) /* HCLK divided by 8 */
#define RCC_CFG_APB2PRES_DIV16 ((uint32_t)0x00003800) /* HCLK divided by 16 */

/** PLLSRC configuration **/
#define RCC_CFG_PLLSRC      ((uint32_t)0x00010000) /* PLL entry clock source */

#define RCC_CFG_PLLSRC_HSI  ((uint32_t)0x00000000) /* HSI clock selected as PLL entry clock source */
#define RCC_CFG_PLLSRC_HSE  ((uint32_t)0x00010000) /* HSE clock selected as PLL entry clock source */

/** PLLHSEPRES configuration **/
#define RCC_CFG_PLLHSEPRES ((uint32_t)0x00020000) /* HSE divider for PLL entry */

