axfnull/N32G401_CodeLib/firmware/CMSIS/device/n32g401f8s7_1.h
#define RCC_CFG_PLLHSEPRES_HSE      ((uint32_t)0x00000000) /* HSE clock not divided for PLL entry */
#define RCC_CFG_PLLHSEPRES_HSE_DIV2 ((uint32_t)0x00020000) /* HSE clock divided by 2 for PLL entry */

/** PLLMULFCT configuration **/
#define RCC_CFG_PLLMULFCT   ((uint32_t)0x083C0000) /* PLLMULFCT[4:0] bits (PLL multiplication factor) */
#define RCC_CFG_PLLMULFCT_0 ((uint32_t)0x00040000) /* Bit 0 */
#define RCC_CFG_PLLMULFCT_1 ((uint32_t)0x00080000) /* Bit 1 */
#define RCC_CFG_PLLMULFCT_2 ((uint32_t)0x00100000) /* Bit 2 */
#define RCC_CFG_PLLMULFCT_3 ((uint32_t)0x00200000) /* Bit 3 */
#define RCC_CFG_PLLMULFCT_4 ((uint32_t)0x08000000) /* Bit 4 */



#define RCC_CFG_PLLMULFCT2          ((uint32_t)0x00000000) /* PLL input clock*2 */
#define RCC_CFG_PLLMULFCT3          ((uint32_t)0x00040000) /* PLL input clock*3 */
#define RCC_CFG_PLLMULFCT4          ((uint32_t)0x00080000) /* PLL input clock*4 */
#define RCC_CFG_PLLMULFCT5          ((uint32_t)0x000C0000) /* PLL input clock*5 */
#define RCC_CFG_PLLMULFCT6          ((uint32_t)0x00100000) /* PLL input clock*6 */
#define RCC_CFG_PLLMULFCT7          ((uint32_t)0x00140000) /* PLL input clock*7 */
#define RCC_CFG_PLLMULFCT8          ((uint32_t)0x00180000) /* PLL input clock*8 */
#define RCC_CFG_PLLMULFCT9          ((uint32_t)0x001C0000) /* PLL input clock*9 */
#define RCC_CFG_PLLMULFCT10         ((uint32_t)0x00200000) /* PLL input clock*10 */
#define RCC_CFG_PLLMULFCT11         ((uint32_t)0x00240000) /* PLL input clock*11 */
#define RCC_CFG_PLLMULFCT12         ((uint32_t)0x00280000) /* PLL input clock*12 */
#define RCC_CFG_PLLMULFCT13         ((uint32_t)0x002C0000) /* PLL input clock*13 */
#define RCC_CFG_PLLMULFCT14         ((uint32_t)0x00300000) /* PLL input clock*14 */
#define RCC_CFG_PLLMULFCT15         ((uint32_t)0x00340000) /* PLL input clock*15 */
#define RCC_CFG_PLLMULFCT16         ((uint32_t)0x00380000) /* PLL input clock*16 */
#define RCC_CFG_PLLMULFCT16N        ((uint32_t)0x003C0000) /* PLL input clock*16 */
#define RCC_CFG_PLLMULFCT17         ((uint32_t)0x08000000) /* PLL input clock*17 */
#define RCC_CFG_PLLMULFCT18         ((uint32_t)0x08040000) /* PLL input clock*18 */
#define RCC_CFG_PLLMULFCT19         ((uint32_t)0x08080000) /* PLL input clock*19 */
#define RCC_CFG_PLLMULFCT20         ((uint32_t)0x080C0000) /* PLL input clock*20 */
#define RCC_CFG_PLLMULFCT21         ((uint32_t)0x08100000) /* PLL input clock*21 */
#define RCC_CFG_PLLMULFCT22         ((uint32_t)0x08140000) /* PLL input clock*22 */
#define RCC_CFG_PLLMULFCT23         ((uint32_t)0x08180000) /* PLL input clock*23 */
#define RCC_CFG_PLLMULFCT24         ((uint32_t)0x081C0000) /* PLL input clock*24 */
#define RCC_CFG_PLLMULFCT25         ((uint32_t)0x08200000) /* PLL input clock*25 */
#define RCC_CFG_PLLMULFCT26         ((uint32_t)0x08240000) /* PLL input clock*26 */
#define RCC_CFG_PLLMULFCT27         ((uint32_t)0x08280000) /* PLL input clock*27 */
#define RCC_CFG_PLLMULFCT28         ((uint32_t)0x082C0000) /* PLL input clock*28 */
#define RCC_CFG_PLLMULFCT29         ((uint32_t)0x08300000) /* PLL input clock*29 */
#define RCC_CFG_PLLMULFCT30         ((uint32_t)0x08340000) /* PLL input clock*30 */
#define RCC_CFG_PLLMULFCT31         ((uint32_t)0x08380000) /* PLL input clock*31 */
#define RCC_CFG_PLLMULFCT32         ((uint32_t)0x083C0000) /* PLL input clock*32 */

/** MCO configuration **/
#define RCC_CFG_MCO   ((uint32_t)0x07800000) /* MCO[3:0] bits (Microcontroller Clock Output) */
#define RCC_CFG_MCO_0 ((uint32_t)0x00800000) /* Bit 0 */
#define RCC_CFG_MCO_1 ((uint32_t)0x01000000) /* Bit 1 */
#define RCC_CFG_MCO_2 ((uint32_t)0x02000000) /* Bit 2 */
#define RCC_CFG_MCO_3 ((uint32_t)0x04000000) /* Bit 2 */

#define RCC_CFG_MCO_NOCLK  ((uint32_t)0x00000000) /* No clock */
#define RCC_CFG_MCO_SYSCLK ((uint32_t)0x04000000) /* System clock selected as MCO source */
#define RCC_CFG_MCO_HSI    ((uint32_t)0x04800000) /* HSI clock selected as MCO source */
#define RCC_CFG_MCO_HSE    ((uint32_t)0x05000000) /* HSE clock selected as MCO source  */
#define RCC_CFG_MCO_PLL    ((uint32_t)0x05800000) /* PLL clock divided by 2 selected as MCO source */
#define RCC_CFG_MCO_LSI    ((uint32_t)0x06000000) /* LSI clock  selected as MCO source */

/** MCOPRE configuration **/
#define RCC_CFG_MCOPRES                                                                                                \
    ((uint32_t)0xF0000000) /* MCOPRE[3:0] bits ( PLL prescaler set and cleared by software to generate MCOPRE        \
                              clock.) */
#define RCC_CFG_MCOPRES_0 ((uint32_t)0x10000000) /* Bit 0 */
#define RCC_CFG_MCOPRES_1 ((uint32_t)0x20000000) /* Bit 1 */
#define RCC_CFG_MCOPRES_2 ((uint32_t)0x40000000) /* Bit 2 */
#define RCC_CFG_MCOPRES_3 ((uint32_t)0x80000000) /* Bit 3 */

#define RCC_CFG_MCOPRES_PLLDIV2  ((uint32_t)0x20000000) /* PLL clock is divided by 2 */
#define RCC_CFG_MCOPRES_PLLDIV3  ((uint32_t)0x30000000) /* PLL clock is divided by 3 */
#define RCC_CFG_MCOPRES_PLLDIV4  ((uint32_t)0x40000000) /* PLL clock is divided by 4 */
#define RCC_CFG_MCOPRES_PLLDIV5  ((uint32_t)0x50000000) /* PLL clock is divided by 5 */
#define RCC_CFG_MCOPRES_PLLDIV6  ((uint32_t)0x60000000) /* PLL clock is divided by 6 */
#define RCC_CFG_MCOPRES_PLLDIV7  ((uint32_t)0x70000000) /* PLL clock is divided by 7 */
#define RCC_CFG_MCOPRES_PLLDIV8  ((uint32_t)0x80000000) /* PLL clock is divided by 8 */
#define RCC_CFG_MCOPRES_PLLDIV9  ((uint32_t)0x90000000) /* PLL clock is divided by 9 */
#define RCC_CFG_MCOPRES_PLLDIV10 ((uint32_t)0xA0000000) /* PLL clock is divided by 10 */
#define RCC_CFG_MCOPRES_PLLDIV11 ((uint32_t)0xB0000000) /* PLL clock is divided by 11 */
#define RCC_CFG_MCOPRES_PLLDIV12 ((uint32_t)0xC0000000) /* PLL clock is divided by 12 */
#define RCC_CFG_MCOPRES_PLLDIV13 ((uint32_t)0xD0000000) /* PLL clock is divided by 13 */
#define RCC_CFG_MCOPRES_PLLDIV14 ((uint32_t)0xE0000000) /* PLL clock is divided by 14 */
#define RCC_CFG_MCOPRES_PLLDIV15 ((uint32_t)0xF0000000) /* PLL clock is divided by 15 */

/** Bit definition for RCC_CLKINT register **/
#define RCC_CLKINT_LSIRDIF   ((uint32_t)0x00000001) /* LSI Ready Interrupt flag */
#define RCC_CLKINT_HSIRDIF   ((uint32_t)0x00000004) /* HSI Ready Interrupt flag */
#define RCC_CLKINT_HSERDIF   ((uint32_t)0x00000008) /* HSE Ready Interrupt flag */
#define RCC_CLKINT_PLLRDIF   ((uint32_t)0x00000010) /* PLL Ready Interrupt flag */
#define RCC_CLKINT_CLKSSIF   ((uint32_t)0x00000080) /* Clock Security System Interrupt flag */
#define RCC_CLKINT_LSIRDIEN  ((uint32_t)0x00000100) /* LSI Ready Interrupt Enable */
#define RCC_CLKINT_HSIRDIEN  ((uint32_t)0x00000400) /* HSI Ready Interrupt Enable */
#define RCC_CLKINT_HSERDIEN  ((uint32_t)0x00000800) /* HSE Ready Interrupt Enable */
#define RCC_CLKINT_PLLRDIEN  ((uint32_t)0x00001000) /* PLL Ready Interrupt Enable */
#define RCC_CLKINT_LSIRDICLR ((uint32_t)0x00010000) /* LSI Ready Interrupt Clear */
#define RCC_CLKINT_HSIRDICLR ((uint32_t)0x00040000) /* HSI Ready Interrupt Clear */
#define RCC_CLKINT_HSERDICLR ((uint32_t)0x00080000) /* HSE Ready Interrupt Clear */
#define RCC_CLKINT_PLLRDICLR ((uint32_t)0x00100000) /* PLL Ready Interrupt Clear */
#define RCC_CLKINT_CLKSSICLR ((uint32_t)0x00800000) /* Clock Security System Interrupt Clear */

/** Bit definition for RCC_APB2PRST register **/
#define RCC_APB2PRST_AFIORST   ((uint32_t)0x00000001) /* Alternate Function I/O reset */
#define RCC_APB2PRST_BEEPRST   ((uint32_t)0x00000002) /* Beeper reset */
#define RCC_APB2PRST_TIM1RST   ((uint32_t)0x00000800) /* Timer 1 reset */
#define RCC_APB2PRST_SPI1RST   ((uint32_t)0x00001000) /* SPI 1 reset */
#define RCC_APB2PRST_TIM8RST   ((uint32_t)0x00002000) /* Timer 8 reset */
#define RCC_APB2PRST_UART1RST ((uint32_t)0x00004000) /* USART 1 reset */
#define RCC_APB2PRST_UART4RST  ((uint32_t)0x00040000) /* UART 4 reset */
#define RCC_APB2PRST_SPI2RST   ((uint32_t)0x00080000) /* SPI 2 reset */

/** Bit definition for RCC_APB1PRST register **/
#define RCC_APB1PRST_TIM2RST   ((uint32_t)0x00000001) /* Timer 2 reset */
#define RCC_APB1PRST_TIM3RST   ((uint32_t)0x00000002) /* Timer 3 reset */
#define RCC_APB1PRST_TIM4RST   ((uint32_t)0x00000004) /* Timer 4 reset */
#define RCC_APB1PRST_TIM5RST   ((uint32_t)0x00000008) /* Timer 5 reset */
#define RCC_APB1PRST_TIM6RST   ((uint32_t)0x00000010) /* Timer 6 reset */
#define RCC_APB1PRST_WWDGRST   ((uint32_t)0x00000800) /* Window Watchdog reset */
#define RCC_APB1PRST_USART2RST ((uint32_t)0x00020000) /* USART 2 reset */
#define RCC_APB1PRST_I2C1RST   ((uint32_t)0x00200000) /* I2C 1 reset */
#define RCC_APB1PRST_I2C2RST   ((uint32_t)0x00400000) /* I2C 2 reset */
#define RCC_APB1PRST_PWRRST    ((uint32_t)0x10000000) /* Power interface reset */

/** Bit definition for RCC_AHBPCLKEN register **/
#define RCC_AHBPCLKEN_DMAEN    ((uint32_t)0x00000001) /* DMA clock enable */
#define RCC_AHBPCLKEN_SRAMEN   ((uint32_t)0x00000004) /* SRAM interface clock enable */
#define RCC_AHBPCLKEN_FLITFEN  ((uint32_t)0x00000010) /* FLITF clock enable */
#define RCC_AHBPCLKEN_CRCEN    ((uint32_t)0x00000040) /* CRC clock enable */
#define RCC_AHBPCLKEN_IOPAEN   ((uint32_t)0x00000080) /* I/O port A clock enable */
#define RCC_AHBPCLKEN_IOPBEN   ((uint32_t)0x00000100) /* I/O port B clock enable */
#define RCC_AHBPCLKEN_IOPDEN   ((uint32_t)0x00000400) /* I/O port D clock enable */
#define RCC_AHBPCLKEN_ADCEN    ((uint32_t)0x00001000) /* ADC clock enable */

/** Bit definition for RCC_APB2PCLKEN register **/
#define RCC_APB2PCLKEN_AFIOEN   ((uint32_t)0x00000001) /* Alternate Function I/O enable */
#define RCC_APB2PCLKEN_BEEPEN   ((uint32_t)0x00000002) /* Beeper enable */
#define RCC_APB2PCLKEN_TIM1EN   ((uint32_t)0x00000800) /* Timer 1 enable */
#define RCC_APB2PCLKEN_SPI1EN   ((uint32_t)0x00001000) /* SPI 1 enable */
#define RCC_APB2PCLKEN_TIM8EN   ((uint32_t)0x00002000) /* Timer 8 enable */
#define RCC_APB2PCLKEN_UART1EN ((uint32_t)0x00004000) /* USART 1 enable */
#define RCC_APB2PCLKEN_UART4EN  ((uint32_t)0x00040000) /* UART 4 enable */
#define RCC_APB2PCLKEN_SPI2EN   ((uint32_t)0x00080000) /* SPI 2 enable */

/** Bit definition for RCC_APB1PCLKEN register **/
#define RCC_APB1PCLKEN_TIM2EN       ((uint32_t)0x00000001) /* Timer 2 enable */
#define RCC_APB1PCLKEN_TIM3EN       ((uint32_t)0x00000002) /* Timer 3 enable */
#define RCC_APB1PCLKEN_TIM4EN       ((uint32_t)0x00000004) /* Timer 4 enable */
#define RCC_APB1PCLKEN_TIM5EN       ((uint32_t)0x00000008) /* Timer 5 enable */
#define RCC_APB1PCLKEN_TIM6EN       ((uint32_t)0x00000010) /* Timer 6 enable */
#define RCC_APB1PCLKEN_WWDGEN       ((uint32_t)0x00000800) /* Window Watchdog enable */
#define RCC_APB1PCLKEN_USART2EN     ((uint32_t)0x00020000) /* USART 2 enable */
#define RCC_APB1PCLKEN_I2C1EN       ((uint32_t)0x00200000) /* I2C 1 enable */
#define RCC_APB1PCLKEN_I2C2EN       ((uint32_t)0x00400000) /* I2C 2 enable */
#define RCC_APB1PCLKEN_PWREN        ((uint32_t)0x10000000) /* Power interface enable */

/** Bit definition for RCC_BDCTRL register **/

#define RCC_BDCTRL_RTCSEL   ((uint32_t)0x00000300) /* RTCSEL[1:0] bits (RTC clock source selection) */
#define RCC_BDCTRL_RTCSEL_0 ((uint32_t)0x00000100) /* Bit 0 */
#define RCC_BDCTRL_RTCSEL_1 ((uint32_t)0x00000200) /* Bit 1 */

