axfnull/N32G401_CodeLib/firmware/CMSIS/device/n32g401f8s7_1.h
#define ADC_SAMPT1_SAMP14   ((uint32_t)0x00007000) /* SMP14[2:0] bits (Channel 14 Sample time selection) */
#define ADC_SAMPT1_SAMP14_0 ((uint32_t)0x00001000) /* Bit 0 */
#define ADC_SAMPT1_SAMP14_1 ((uint32_t)0x00002000) /* Bit 1 */
#define ADC_SAMPT1_SAMP14_2 ((uint32_t)0x00004000) /* Bit 2 */

#define ADC_SAMPT1_SAMP15   ((uint32_t)0x00038000) /* SMP15[2:0] bits (Channel 15 Sample time selection) */
#define ADC_SAMPT1_SAMP15_0 ((uint32_t)0x00008000) /* Bit 0 */
#define ADC_SAMPT1_SAMP15_1 ((uint32_t)0x00010000) /* Bit 1 */
#define ADC_SAMPT1_SAMP15_2 ((uint32_t)0x00020000) /* Bit 2 */

#define ADC_SAMPT1_SAMP16   ((uint32_t)0x001C0000) /* SMP16[2:0] bits (Channel 16 Sample time selection) */
#define ADC_SAMPT1_SAMP16_0 ((uint32_t)0x00040000) /* Bit 0 */
#define ADC_SAMPT1_SAMP16_1 ((uint32_t)0x00080000) /* Bit 1 */
#define ADC_SAMPT1_SAMP16_2 ((uint32_t)0x00100000) /* Bit 2 */

#define ADC_SAMPT1_SAMP17   ((uint32_t)0x00E00000) /* SMP17[2:0] bits (Channel 17 Sample time selection) */
#define ADC_SAMPT1_SAMP17_0 ((uint32_t)0x00200000) /* Bit 0 */
#define ADC_SAMPT1_SAMP17_1 ((uint32_t)0x00400000) /* Bit 1 */
#define ADC_SAMPT1_SAMP17_2 ((uint32_t)0x00800000) /* Bit 2 */

/** Bit definition for ADC_SAMPT2 register **/
#define ADC_SAMPT2_SAMP0   ((uint32_t)0x00000007) /* SMP0[2:0] bits (Channel 0 Sample time selection) */
#define ADC_SAMPT2_SAMP0_0 ((uint32_t)0x00000001) /* Bit 0 */
#define ADC_SAMPT2_SAMP0_1 ((uint32_t)0x00000002) /* Bit 1 */
#define ADC_SAMPT2_SAMP0_2 ((uint32_t)0x00000004) /* Bit 2 */

#define ADC_SAMPT2_SAMP1   ((uint32_t)0x00000038) /* SMP1[2:0] bits (Channel 1 Sample time selection) */
#define ADC_SAMPT2_SAMP1_0 ((uint32_t)0x00000008) /* Bit 0 */
#define ADC_SAMPT2_SAMP1_1 ((uint32_t)0x00000010) /* Bit 1 */
#define ADC_SAMPT2_SAMP1_2 ((uint32_t)0x00000020) /* Bit 2 */

#define ADC_SAMPT2_SAMP2   ((uint32_t)0x000001C0) /* SMP2[2:0] bits (Channel 2 Sample time selection) */
#define ADC_SAMPT2_SAMP2_0 ((uint32_t)0x00000040) /* Bit 0 */
#define ADC_SAMPT2_SAMP2_1 ((uint32_t)0x00000080) /* Bit 1 */
#define ADC_SAMPT2_SAMP2_2 ((uint32_t)0x00000100) /* Bit 2 */

#define ADC_SAMPT2_SAMP3   ((uint32_t)0x00000E00) /* SMP3[2:0] bits (Channel 3 Sample time selection) */
#define ADC_SAMPT2_SAMP3_0 ((uint32_t)0x00000200) /* Bit 0 */
#define ADC_SAMPT2_SAMP3_1 ((uint32_t)0x00000400) /* Bit 1 */
#define ADC_SAMPT2_SAMP3_2 ((uint32_t)0x00000800) /* Bit 2 */

#define ADC_SAMPT2_SAMP4   ((uint32_t)0x00007000) /* SMP4[2:0] bits (Channel 4 Sample time selection) */
#define ADC_SAMPT2_SAMP4_0 ((uint32_t)0x00001000) /* Bit 0 */
#define ADC_SAMPT2_SAMP4_1 ((uint32_t)0x00002000) /* Bit 1 */
#define ADC_SAMPT2_SAMP4_2 ((uint32_t)0x00004000) /* Bit 2 */

#define ADC_SAMPT2_SAMP5   ((uint32_t)0x00038000) /* SMP5[2:0] bits (Channel 5 Sample time selection) */
#define ADC_SAMPT2_SAMP5_0 ((uint32_t)0x00008000) /* Bit 0 */
#define ADC_SAMPT2_SAMP5_1 ((uint32_t)0x00010000) /* Bit 1 */
#define ADC_SAMPT2_SAMP5_2 ((uint32_t)0x00020000) /* Bit 2 */

#define ADC_SAMPT2_SAMP6   ((uint32_t)0x001C0000) /* SMP6[2:0] bits (Channel 6 Sample time selection) */
#define ADC_SAMPT2_SAMP6_0 ((uint32_t)0x00040000) /* Bit 0 */
#define ADC_SAMPT2_SAMP6_1 ((uint32_t)0x00080000) /* Bit 1 */
#define ADC_SAMPT2_SAMP6_2 ((uint32_t)0x00100000) /* Bit 2 */

#define ADC_SAMPT2_SAMP7   ((uint32_t)0x00E00000) /* SMP7[2:0] bits (Channel 7 Sample time selection) */
#define ADC_SAMPT2_SAMP7_0 ((uint32_t)0x00200000) /* Bit 0 */
#define ADC_SAMPT2_SAMP7_1 ((uint32_t)0x00400000) /* Bit 1 */
#define ADC_SAMPT2_SAMP7_2 ((uint32_t)0x00800000) /* Bit 2 */

#define ADC_SAMPT2_SAMP8   ((uint32_t)0x07000000) /* SMP8[2:0] bits (Channel 8 Sample time selection) */
#define ADC_SAMPT2_SAMP8_0 ((uint32_t)0x01000000) /* Bit 0 */
#define ADC_SAMPT2_SAMP8_1 ((uint32_t)0x02000000) /* Bit 1 */
#define ADC_SAMPT2_SAMP8_2 ((uint32_t)0x04000000) /* Bit 2 */

#define ADC_SAMPT2_SAMP9   ((uint32_t)0x38000000) /* SMP9[2:0] bits (Channel 9 Sample time selection) */
#define ADC_SAMPT2_SAMP9_0 ((uint32_t)0x08000000) /* Bit 0 */
#define ADC_SAMPT2_SAMP9_1 ((uint32_t)0x10000000) /* Bit 1 */
#define ADC_SAMPT2_SAMP9_2 ((uint32_t)0x20000000) /* Bit 2 */

/** Bit definition for ADC_JOFFSET1 register **/
#define ADC_JOFFSET1_OFFSETJCH1 ((uint16_t)0x0FFF) /* Data offset for injected channel 1 */

/** Bit definition for ADC_JOFFSET2 register **/
#define ADC_JOFFSET2_OFFSETJCH2 ((uint16_t)0x0FFF) /* Data offset for injected channel 2 */

/** Bit definition for ADC_JOFFSET3 register **/
#define ADC_JOFFSET3_OFFSETJCH3 ((uint16_t)0x0FFF) /* Data offset for injected channel 3 */

/** Bit definition for ADC_JOFFSET4 register **/
#define ADC_JOFFSET4_OFFSETJCH4 ((uint16_t)0x0FFF) /* Data offset for injected channel 4 */

/** Bit definition for ADC_WDGHIGH register **/
#define ADC_WDGHIGH_HTH ((uint16_t)0x0FFF) /* Analog watchdog high threshold */

/** Bit definition for ADC_WDGLOW register **/
#define ADC_WDGLOW_LTH  ((uint16_t)0x0FFF) /* Analog watchdog low threshold */

/** Bit definition for ADC_RSEQ1 register **/
#define ADC_RSEQ1_SEQ13   ((uint32_t)0x0000001F) /* SQ13[4:0] bits (13th conversion in regular sequence) */
#define ADC_RSEQ1_SEQ13_0 ((uint32_t)0x00000001) /* Bit 0 */
#define ADC_RSEQ1_SEQ13_1 ((uint32_t)0x00000002) /* Bit 1 */
#define ADC_RSEQ1_SEQ13_2 ((uint32_t)0x00000004) /* Bit 2 */
#define ADC_RSEQ1_SEQ13_3 ((uint32_t)0x00000008) /* Bit 3 */
#define ADC_RSEQ1_SEQ13_4 ((uint32_t)0x00000010) /* Bit 4 */

#define ADC_RSEQ1_SEQ14   ((uint32_t)0x000003E0) /* SQ14[4:0] bits (14th conversion in regular sequence) */
#define ADC_RSEQ1_SEQ14_0 ((uint32_t)0x00000020) /* Bit 0 */
#define ADC_RSEQ1_SEQ14_1 ((uint32_t)0x00000040) /* Bit 1 */
#define ADC_RSEQ1_SEQ14_2 ((uint32_t)0x00000080) /* Bit 2 */
#define ADC_RSEQ1_SEQ14_3 ((uint32_t)0x00000100) /* Bit 3 */
#define ADC_RSEQ1_SEQ14_4 ((uint32_t)0x00000200) /* Bit 4 */

#define ADC_RSEQ1_SEQ15   ((uint32_t)0x00007C00) /* SQ15[4:0] bits (15th conversion in regular sequence) */
#define ADC_RSEQ1_SEQ15_0 ((uint32_t)0x00000400) /* Bit 0 */
#define ADC_RSEQ1_SEQ15_1 ((uint32_t)0x00000800) /* Bit 1 */
#define ADC_RSEQ1_SEQ15_2 ((uint32_t)0x00001000) /* Bit 2 */
#define ADC_RSEQ1_SEQ15_3 ((uint32_t)0x00002000) /* Bit 3 */
#define ADC_RSEQ1_SEQ15_4 ((uint32_t)0x00004000) /* Bit 4 */

#define ADC_RSEQ1_SEQ16   ((uint32_t)0x000F8000) /* SQ16[4:0] bits (16th conversion in regular sequence) */
#define ADC_RSEQ1_SEQ16_0 ((uint32_t)0x00008000) /* Bit 0 */
#define ADC_RSEQ1_SEQ16_1 ((uint32_t)0x00010000) /* Bit 1 */
#define ADC_RSEQ1_SEQ16_2 ((uint32_t)0x00020000) /* Bit 2 */
#define ADC_RSEQ1_SEQ16_3 ((uint32_t)0x00040000) /* Bit 3 */
#define ADC_RSEQ1_SEQ16_4 ((uint32_t)0x00080000) /* Bit 4 */

#define ADC_RSEQ1_LEN    ((uint32_t)0x00F00000) /* L[3:0] bits (Regular channel sequence length) */
#define ADC_RSEQ1_LEN_0  ((uint32_t)0x00100000) /* Bit 0 */
#define ADC_RSEQ1_LEN_1  ((uint32_t)0x00200000) /* Bit 1 */
#define ADC_RSEQ1_LEN_2  ((uint32_t)0x00400000) /* Bit 2 */
#define ADC_RSEQ1_LEN_3  ((uint32_t)0x00800000) /* Bit 3 */

