axfnull/N32G401_CodeLib/firmware/CMSIS/device/n32g401f8s7_1.h
/** Bit definition for ADC_RSEQ2 register **/
#define ADC_RSEQ2_SEQ7   ((uint32_t)0x0000001F) /* SQ7[4:0] bits (7th conversion in regular sequence) */
#define ADC_RSEQ2_SEQ7_0 ((uint32_t)0x00000001) /* Bit 0 */
#define ADC_RSEQ2_SEQ7_1 ((uint32_t)0x00000002) /* Bit 1 */
#define ADC_RSEQ2_SEQ7_2 ((uint32_t)0x00000004) /* Bit 2 */
#define ADC_RSEQ2_SEQ7_3 ((uint32_t)0x00000008) /* Bit 3 */
#define ADC_RSEQ2_SEQ7_4 ((uint32_t)0x00000010) /* Bit 4 */

#define ADC_RSEQ2_SEQ8   ((uint32_t)0x000003E0) /* SQ8[4:0] bits (8th conversion in regular sequence) */
#define ADC_RSEQ2_SEQ8_0 ((uint32_t)0x00000020) /* Bit 0 */
#define ADC_RSEQ2_SEQ8_1 ((uint32_t)0x00000040) /* Bit 1 */
#define ADC_RSEQ2_SEQ8_2 ((uint32_t)0x00000080) /* Bit 2 */
#define ADC_RSEQ2_SEQ8_3 ((uint32_t)0x00000100) /* Bit 3 */
#define ADC_RSEQ2_SEQ8_4 ((uint32_t)0x00000200) /* Bit 4 */

#define ADC_RSEQ2_SEQ9   ((uint32_t)0x00007C00) /* SQ9[4:0] bits (9th conversion in regular sequence) */
#define ADC_RSEQ2_SEQ9_0 ((uint32_t)0x00000400) /* Bit 0 */
#define ADC_RSEQ2_SEQ9_1 ((uint32_t)0x00000800) /* Bit 1 */
#define ADC_RSEQ2_SEQ9_2 ((uint32_t)0x00001000) /* Bit 2 */
#define ADC_RSEQ2_SEQ9_3 ((uint32_t)0x00002000) /* Bit 3 */
#define ADC_RSEQ2_SEQ9_4 ((uint32_t)0x00004000) /* Bit 4 */

#define ADC_RSEQ2_SEQ10   ((uint32_t)0x000F8000) /* SQ10[4:0] bits (10th conversion in regular sequence) */
#define ADC_RSEQ2_SEQ10_0 ((uint32_t)0x00008000) /* Bit 0 */
#define ADC_RSEQ2_SEQ10_1 ((uint32_t)0x00010000) /* Bit 1 */
#define ADC_RSEQ2_SEQ10_2 ((uint32_t)0x00020000) /* Bit 2 */
#define ADC_RSEQ2_SEQ10_3 ((uint32_t)0x00040000) /* Bit 3 */
#define ADC_RSEQ2_SEQ10_4 ((uint32_t)0x00080000) /* Bit 4 */

#define ADC_RSEQ2_SEQ11   ((uint32_t)0x01F00000) /* SQ11[4:0] bits (11th conversion in regular sequence) */
#define ADC_RSEQ2_SEQ11_0 ((uint32_t)0x00100000) /* Bit 0 */
#define ADC_RSEQ2_SEQ11_1 ((uint32_t)0x00200000) /* Bit 1 */
#define ADC_RSEQ2_SEQ11_2 ((uint32_t)0x00400000) /* Bit 2 */
#define ADC_RSEQ2_SEQ11_3 ((uint32_t)0x00800000) /* Bit 3 */
#define ADC_RSEQ2_SEQ11_4 ((uint32_t)0x01000000) /* Bit 4 */

#define ADC_RSEQ2_SEQ12   ((uint32_t)0x3E000000) /* SQ12[4:0] bits (12th conversion in regular sequence) */
#define ADC_RSEQ2_SEQ12_0 ((uint32_t)0x02000000) /* Bit 0 */
#define ADC_RSEQ2_SEQ12_1 ((uint32_t)0x04000000) /* Bit 1 */
#define ADC_RSEQ2_SEQ12_2 ((uint32_t)0x08000000) /* Bit 2 */
#define ADC_RSEQ2_SEQ12_3 ((uint32_t)0x10000000) /* Bit 3 */
#define ADC_RSEQ2_SEQ12_4 ((uint32_t)0x20000000) /* Bit 4 */

/** Bit definition for ADC_RSEQ3 register **/
#define ADC_RSEQ3_SEQ1   ((uint32_t)0x0000001F) /* SQ1[4:0] bits (1st conversion in regular sequence) */
#define ADC_RSEQ3_SEQ1_0 ((uint32_t)0x00000001) /* Bit 0 */
#define ADC_RSEQ3_SEQ1_1 ((uint32_t)0x00000002) /* Bit 1 */
#define ADC_RSEQ3_SEQ1_2 ((uint32_t)0x00000004) /* Bit 2 */
#define ADC_RSEQ3_SEQ1_3 ((uint32_t)0x00000008) /* Bit 3 */
#define ADC_RSEQ3_SEQ1_4 ((uint32_t)0x00000010) /* Bit 4 */

#define ADC_RSEQ3_SEQ2   ((uint32_t)0x000003E0) /* SQ2[4:0] bits (2nd conversion in regular sequence) */
#define ADC_RSEQ3_SEQ2_0 ((uint32_t)0x00000020) /* Bit 0 */
#define ADC_RSEQ3_SEQ2_1 ((uint32_t)0x00000040) /* Bit 1 */
#define ADC_RSEQ3_SEQ2_2 ((uint32_t)0x00000080) /* Bit 2 */
#define ADC_RSEQ3_SEQ2_3 ((uint32_t)0x00000100) /* Bit 3 */
#define ADC_RSEQ3_SEQ2_4 ((uint32_t)0x00000200) /* Bit 4 */

#define ADC_RSEQ3_SEQ3   ((uint32_t)0x00007C00) /* SQ3[4:0] bits (3rd conversion in regular sequence) */
#define ADC_RSEQ3_SEQ3_0 ((uint32_t)0x00000400) /* Bit 0 */
#define ADC_RSEQ3_SEQ3_1 ((uint32_t)0x00000800) /* Bit 1 */
#define ADC_RSEQ3_SEQ3_2 ((uint32_t)0x00001000) /* Bit 2 */
#define ADC_RSEQ3_SEQ3_3 ((uint32_t)0x00002000) /* Bit 3 */
#define ADC_RSEQ3_SEQ3_4 ((uint32_t)0x00004000) /* Bit 4 */

#define ADC_RSEQ3_SEQ4   ((uint32_t)0x000F8000) /* SQ4[4:0] bits (4th conversion in regular sequence) */
#define ADC_RSEQ3_SEQ4_0 ((uint32_t)0x00008000) /* Bit 0 */
#define ADC_RSEQ3_SEQ4_1 ((uint32_t)0x00010000) /* Bit 1 */
#define ADC_RSEQ3_SEQ4_2 ((uint32_t)0x00020000) /* Bit 2 */
#define ADC_RSEQ3_SEQ4_3 ((uint32_t)0x00040000) /* Bit 3 */
#define ADC_RSEQ3_SEQ4_4 ((uint32_t)0x00080000) /* Bit 4 */

#define ADC_RSEQ3_SEQ5   ((uint32_t)0x01F00000) /* SQ5[4:0] bits (5th conversion in regular sequence) */
#define ADC_RSEQ3_SEQ5_0 ((uint32_t)0x00100000) /* Bit 0 */
#define ADC_RSEQ3_SEQ5_1 ((uint32_t)0x00200000) /* Bit 1 */
#define ADC_RSEQ3_SEQ5_2 ((uint32_t)0x00400000) /* Bit 2 */
#define ADC_RSEQ3_SEQ5_3 ((uint32_t)0x00800000) /* Bit 3 */
#define ADC_RSEQ3_SEQ5_4 ((uint32_t)0x01000000) /* Bit 4 */

#define ADC_RSEQ3_SEQ6   ((uint32_t)0x3E000000) /* SQ6[4:0] bits (6th conversion in regular sequence) */
#define ADC_RSEQ3_SEQ6_0 ((uint32_t)0x02000000) /* Bit 0 */
#define ADC_RSEQ3_SEQ6_1 ((uint32_t)0x04000000) /* Bit 1 */
#define ADC_RSEQ3_SEQ6_2 ((uint32_t)0x08000000) /* Bit 2 */
#define ADC_RSEQ3_SEQ6_3 ((uint32_t)0x10000000) /* Bit 3 */
#define ADC_RSEQ3_SEQ6_4 ((uint32_t)0x20000000) /* Bit 4 */

/** Bit definition for ADC_JSEQ register **/
#define ADC_JSEQ_JSEQ1   ((uint32_t)0x0000001F) /* JSQ1[4:0] bits (1st conversion in injected sequence) */
#define ADC_JSEQ_JSEQ1_0 ((uint32_t)0x00000001) /* Bit 0 */
#define ADC_JSEQ_JSEQ1_1 ((uint32_t)0x00000002) /* Bit 1 */
#define ADC_JSEQ_JSEQ1_2 ((uint32_t)0x00000004) /* Bit 2 */
#define ADC_JSEQ_JSEQ1_3 ((uint32_t)0x00000008) /* Bit 3 */
#define ADC_JSEQ_JSEQ1_4 ((uint32_t)0x00000010) /* Bit 4 */

#define ADC_JSEQ_JSEQ2   ((uint32_t)0x000003E0) /* JSQ2[4:0] bits (2nd conversion in injected sequence) */
#define ADC_JSEQ_JSEQ2_0 ((uint32_t)0x00000020) /* Bit 0 */
#define ADC_JSEQ_JSEQ2_1 ((uint32_t)0x00000040) /* Bit 1 */
#define ADC_JSEQ_JSEQ2_2 ((uint32_t)0x00000080) /* Bit 2 */
#define ADC_JSEQ_JSEQ2_3 ((uint32_t)0x00000100) /* Bit 3 */
#define ADC_JSEQ_JSEQ2_4 ((uint32_t)0x00000200) /* Bit 4 */

#define ADC_JSEQ_JSEQ3   ((uint32_t)0x00007C00) /* JSQ3[4:0] bits (3rd conversion in injected sequence) */
#define ADC_JSEQ_JSEQ3_0 ((uint32_t)0x00000400) /* Bit 0 */
#define ADC_JSEQ_JSEQ3_1 ((uint32_t)0x00000800) /* Bit 1 */
#define ADC_JSEQ_JSEQ3_2 ((uint32_t)0x00001000) /* Bit 2 */
#define ADC_JSEQ_JSEQ3_3 ((uint32_t)0x00002000) /* Bit 3 */
#define ADC_JSEQ_JSEQ3_4 ((uint32_t)0x00004000) /* Bit 4 */

