axfnull/N32G401_CodeLib/firmware/CMSIS/device/n32g401f8s7_1.h
#define ADC_JSEQ_JSEQ4   ((uint32_t)0x000F8000) /* JSQ4[4:0] bits (4th conversion in injected sequence) */
#define ADC_JSEQ_JSEQ4_0 ((uint32_t)0x00008000) /* Bit 0 */
#define ADC_JSEQ_JSEQ4_1 ((uint32_t)0x00010000) /* Bit 1 */
#define ADC_JSEQ_JSEQ4_2 ((uint32_t)0x00020000) /* Bit 2 */
#define ADC_JSEQ_JSEQ4_3 ((uint32_t)0x00040000) /* Bit 3 */
#define ADC_JSEQ_JSEQ4_4 ((uint32_t)0x00080000) /* Bit 4 */

#define ADC_JSEQ_JLEN    ((uint32_t)0x00300000) /* INJ_LEN[1:0] bits (Injected Sequence length) */
#define ADC_JSEQ_JLEN_0  ((uint32_t)0x00100000) /* Bit 0 */
#define ADC_JSEQ_JLEN_1  ((uint32_t)0x00200000) /* Bit 1 */

/** Bit definition for ADC_JDAT1 register **/
#define ADC_JDAT1_JDAT  ((uint16_t)0xFFFF) /* Injected data */

/** Bit definition for ADC_JDAT2 register **/
#define ADC_JDAT2_JDAT  ((uint16_t)0xFFFF) /* Injected data */

/** Bit definition for ADC_JDAT3 register **/
#define ADC_JDAT3_JDAT  ((uint16_t)0xFFFF) /* Injected data */

/** Bit definition for ADC_JDAT4 register **/
#define ADC_JDAT4_JDAT  ((uint16_t)0xFFFF) /* Injected data */

/** Bit definition for ADC_DAT register **/
#define ADC_DAT_DAT     ((uint32_t)0x0000FFFF) /* Regular data */
#define ADC_DAT_ADC2DAT ((uint32_t)0xFFFF0000) /* ADC2 data */

/** Bit definition for ADC_DIFSEL register **/
#define ADC_DIFSEL_DIFSEL        ((uint32_t)0x0007FFFE) /* Differential data */
#define ADC_DIFSEL_DIFSEL_0      ((uint32_t)0x00000002) /* Differential_1 data */
#define ADC_DIFSEL_DIFSEL_1      ((uint32_t)0x00000004) /* Differential_2 data */
#define ADC_DIFSEL_DIFSEL_2      ((uint32_t)0x00000008) /* Differential_3 data */
#define ADC_DIFSEL_DIFSEL_3      ((uint32_t)0x00000010) /* Differential_4 data */
#define ADC_DIFSEL_DIFSEL_4      ((uint32_t)0x00000020) /* Differential_5 data */
#define ADC_DIFSEL_DIFSEL_5      ((uint32_t)0x00000040) /* Differential_6 data */
#define ADC_DIFSEL_DIFSEL_6      ((uint32_t)0x00000080) /* Differential_7 data */
#define ADC_DIFSEL_DIFSEL_7      ((uint32_t)0x00000100) /* Differential_8 data */
#define ADC_DIFSEL_DIFSEL_8      ((uint32_t)0x00000200) /* Differential_9 data */
#define ADC_DIFSEL_DIFSEL_9      ((uint32_t)0x00000400) /* Differential_10 data */
#define ADC_DIFSEL_DIFSEL_10     ((uint32_t)0x00000800) /* Differential_11 data */
#define ADC_DIFSEL_DIFSEL_11     ((uint32_t)0x00001000) /* Differential_12 data */
#define ADC_DIFSEL_DIFSEL_12     ((uint32_t)0x00002000) /* Differential_13 data */
#define ADC_DIFSEL_DIFSEL_13     ((uint32_t)0x00004000) /* Differential_14 data */
#define ADC_DIFSEL_DIFSEL_14     ((uint32_t)0x00008000) /* Differential_15 data */
#define ADC_DIFSEL_DIFSEL_15     ((uint32_t)0x00010000) /* Differential_16 data */
#define ADC_DIFSEL_DIFSEL_16     ((uint32_t)0x00020000) /* Differential_17 data */
#define ADC_DIFSEL_DIFSEL_17     ((uint32_t)0x00040000) /* Differential_18 data */

/** Bit definition for ADC_CALFACT register **/
#define ADC_CALFACT_CALFACTS     ((uint32_t)0x0000007F) /* Calibration factors in single data */
#define ADC_CALFACT_CALFACTS_0   ((uint32_t)0x00000001) /* Calibration factors_0 in single data */
#define ADC_CALFACT_CALFACTS_1   ((uint32_t)0x00000002) /* Calibration factors_1 in single data */
#define ADC_CALFACT_CALFACTS_2   ((uint32_t)0x00000004) /* Calibration factors_2 in single data */
#define ADC_CALFACT_CALFACTS_3   ((uint32_t)0x00000008) /* Calibration factors_3 in single data */
#define ADC_CALFACT_CALFACTS_4   ((uint32_t)0x00000010) /* Calibration factors_4 in single data */
#define ADC_CALFACT_CALFACTS_5   ((uint32_t)0x00000020) /* Calibration factors_5 in single data */
#define ADC_CALFACT_CALFACTS_6   ((uint32_t)0x00000040) /* Calibration factors_6 in single data */

#define ADC_CALFACT_CALFACTD     ((uint32_t)0x007F0000) /* Calibration factors in differential data */
#define ADC_CALFACT_CALFACTD_0   ((uint32_t)0x00010000) /* Calibration factors_0 in differential data */
#define ADC_CALFACT_CALFACTD_1   ((uint32_t)0x00020000) /* Calibration factors_1 in differential data */
#define ADC_CALFACT_CALFACTD_2   ((uint32_t)0x00040000) /* Calibration factors_2 in differential data */
#define ADC_CALFACT_CALFACTD_3   ((uint32_t)0x00080000) /* Calibration factors_3 in differential data */
#define ADC_CALFACT_CALFACTD_4   ((uint32_t)0x00100000) /* Calibration factors_4 in differential data */
#define ADC_CALFACT_CALFACTD_5   ((uint32_t)0x00200000) /* Calibration factors_5 in differential data */
#define ADC_CALFACT_CALFACTD_6   ((uint32_t)0x00400000) /* Calibration factors_6 in differential data */

/** ADC_CTRL3 register **/
#define ADC_CTRL3_RES        ((uint32_t)0x00000003) /* Resolution data */
#define ADC_CTRL3_RES_0      ((uint32_t)0x00000001) /* Resolution_0 data */
#define ADC_CTRL3_RES_1      ((uint32_t)0x00000002) /* Resolution_1 data */

#define ADC_CTRL3_CALDIF     ((uint32_t)0x00000004) /* Differential mode for calibration enable */
#define ADC_CTRL3_CALALD     ((uint32_t)0x00000008) /* Differential mode for calibration auto reload enable */
#define ADC_CTRL3_CKMOD      ((uint32_t)0x00000010) /* Clock mode selection */
#define ADC_CTRL3_RDY        ((uint32_t)0x00000020) /* Ready flag */
#define ADC_CTRL3_PDRDY      ((uint32_t)0x00000040) /* Powerdown ready flag */
#define ADC_CTRL3_BPCAL      ((uint32_t)0x00000080) /* Bypass calibration */
#define ADC_CTRL3_ENDCAIEN   ((uint32_t)0x00000100) /* Interrupt enable for any regular channels */
#define ADC_CTRL3_JENDCAIEN  ((uint32_t)0x00000200) /* Interrupt enable for any injected channels */
#define ADC_CTRL3_DPWMOD     ((uint32_t)0x00000400) /* Deep Power Mode */
#define ADC_CTRL3_VBATMEN    ((uint32_t)0x00000800) /* Vbat monitor enable */

/** Bit definition for ADC_SAMPT3 register **/
#define ADC_SAMPT3_SAMP18    ((uint32_t)0x00000007) /* SMP9[2:0] bits (Channel 9 Sample time selection) */
#define ADC_SAMPT3_SAMP18_0  ((uint32_t)0x00000001) /* Bit 0 */
#define ADC_SAMPT3_SAMP18_1  ((uint32_t)0x00000002) /* Bit 1 */
#define ADC_SAMPT3_SAMP18_2  ((uint32_t)0x00000004) /* Bit 2 */

#define ADC_SAMPT3_SAMPSEL   ((uint32_t)0x00000008) /* Sample time selection */


/*** TIM ***/

/** Bit definition for TIM_CTRL1 register  **/

