axfnull/N32G401_CodeLib/firmware/CMSIS/device/n32g401f8s7_1.h
/** Bit definition for TIM_C1FILT register **/
#define TIM_C1FILT_THRESH       ((uint32_t)0x3F000000)
#define TIM_C1FILT_WSIZE        ((uint32_t)0x007E0000)
#define TIM_C1FILT_FILTEN       ((uint32_t)0x00010000)
#define TIM_C1FILT_PSC          ((uint32_t)0x0000FFFF)

/** Bit definition for TIM_C2FILT register **/
#define TIM_C2FILT_THRESH       ((uint32_t)0x3F000000)
#define TIM_C2FILT_WSIZE        ((uint32_t)0x007E0000)
#define TIM_C2FILT_FILTEN       ((uint32_t)0x00010000)
#define TIM_C2FILT_PSC          ((uint32_t)0x0000FFFF)

/** Bit definition for TIM_C3FILT register **/
#define TIM_C3FILT_THRESH       ((uint32_t)0x3F000000)
#define TIM_C3FILT_WSIZE        ((uint32_t)0x007E0000)
#define TIM_C3FILT_FILTEN       ((uint32_t)0x00010000)
#define TIM_C3FILT_PSC          ((uint32_t)0x0000FFFF)

/** Bit definition for TIM_C4FILT register **/
#define TIM_C4FILT_THRESH       ((uint32_t)0x3F000000)
#define TIM_C4FILT_WSIZE        ((uint32_t)0x007E0000)
#define TIM_C4FILT_FILTEN       ((uint32_t)0x00010000)
#define TIM_C4FILT_PSC          ((uint32_t)0x0000FFFF)

/** Bit definition for TIM_FILTO register **/
#define TIM_FILTO_C1_FILTO      ((uint32_t)0x00000001)
#define TIM_FILTO_C2_FILTO      ((uint32_t)0x00000002)
#define TIM_FILTO_C3_FILTO      ((uint32_t)0x00000004)
#define TIM_FILTO_C4_FILTO      ((uint32_t)0x00000008)


/*** Low Power Timer (LPTTIM) ***/



/** Bit definition for LPTIM_INTSTS register **/
#define LPTIM_INTSTS_CMPM       ((uint32_t)0x00000001)  /* Compare match */
#define LPTIM_INTSTS_ARRM       ((uint32_t)0x00000002)  /* Autoreload match */
#define LPTIM_INTSTS_EXTRIG     ((uint32_t)0x00000004)  /* External trigger edge event */
#define LPTIM_INTSTS_CMPUPD     ((uint32_t)0x00000008)  /* Compare register update OK */
#define LPTIM_INTSTS_ARRUPD     ((uint32_t)0x00000010)  /* Autoreload register update OK */
#define LPTIM_INTSTS_UP         ((uint32_t)0x00000020)  /* Counter direction change down to up */
#define LPTIM_INTSTS_DOWN       ((uint32_t)0x00000040)  /* Counter direction change up to down */

/** Bit definition for LPTIM_INTCLR register **/
#define LPTIM_INTCLR_CMPMCF     ((uint32_t)0x00000001)  /* Compare match Clear Flag */
#define LPTIM_INTCLR_ARRMCF     ((uint32_t)0x00000002)  /* Autoreload match Clear Flag */
#define LPTIM_INTCLR_EXTRIGCF   ((uint32_t)0x00000004)  /* External trigger edge event Clear Flag */
#define LPTIM_INTCLR_CMPUPDCF   ((uint32_t)0x00000008)  /* Compare register update OK Clear Flag */
#define LPTIM_INTCLR_ARRUPDCF   ((uint32_t)0x00000010)  /* Autoreload register update OK Clear Flag */
#define LPTIM_INTCLR_UPCF       ((uint32_t)0x00000020)  /* Counter direction change down to up Clear Flag */
#define LPTIM_INTCLR_DOWNCF     ((uint32_t)0x00000040)  /* Counter direction change up to down Clear Flag */

/** Bit definition for LPTIM_INTEN register **/
#define LPTIM_INTEN_CMPMIE      ((uint32_t)0x00000001)  /* Compare match Interrupt Enable */
#define LPTIM_INTEN_ARRMIE      ((uint32_t)0x00000002)  /* Autoreload match Interrupt Enable */
#define LPTIM_INTEN_EXTRIGIE    ((uint32_t)0x00000004)  /* External trigger edge event Interrupt Enable */
#define LPTIM_INTEN_CMPUPDIE    ((uint32_t)0x00000008)  /* Compare register update OK Interrupt Enable */
#define LPTIM_INTEN_ARRUPDIE    ((uint32_t)0x00000010)  /* Autoreload register update OK Interrupt Enable */
#define LPTIM_INTEN_UPIE        ((uint32_t)0x00000020)  /* Counter direction change down to up Interrupt Enable */
#define LPTIM_INTEN_DOWNIE      ((uint32_t)0x00000040)  /* Counter direction change up to down Interrupt Enable */

/** Bit definition for LPTIM_CFG register **/
#define LPTIM_CFG_CLKSEL        ((uint32_t)0x00000001)  /* Clock selector */

#define LPTIM_CFG_CLKPOL        ((uint32_t)0x00000006)  /* CLKP[1:0] bits (Clock polarity) */
#define LPTIM_CFG_CLKPOL_0      ((uint32_t)0x00000002)  /* Bit 0 */
#define LPTIM_CFG_CLKPOL_1      ((uint32_t)0x00000004)  /* Bit 1 */

#define LPTIM_CFG_CLKFLT        ((uint32_t)0x00000018)  /* CFGDFFEXT[1:0] bits (Configurable digital filter for external clock) */
#define LPTIM_CFG_CLKFLT_0      ((uint32_t)0x00000008)  /* Bit 0 */
#define LPTIM_CFG_CLKFLT_1      ((uint32_t)0x00000010)  /* Bit 1 */

#define LPTIM_CFG_TRIGFLT       ((uint32_t)0x000000C0)  /* CFGDFFTRG[1:0] bits (Configurable digital filter for trigger) */
#define LPTIM_CFG_TRIGFLT_0     ((uint32_t)0x00000040)  /* Bit 0 */
#define LPTIM_CFG_TRIGFLT_1     ((uint32_t)0x00000080)  /* Bit 1 */

#define LPTIM_CFG_CLKPRE        ((uint32_t)0x00000E00)  /* CLKPRE[2:0] bits (Clock prescaler) */
#define LPTIM_CFG_CLKPRE_0      ((uint32_t)0x00000200)  /* Bit 0 */
#define LPTIM_CFG_CLKPRE_1      ((uint32_t)0x00000400)  /* Bit 1 */
#define LPTIM_CFG_CLKPRE_2      ((uint32_t)0x00000800)  /* Bit 2 */

#define LPTIM_CFG_TRGSEL        ((uint32_t)0x0001E000)  /* TRGS[3:0] bits (Trigger selector) */
#define LPTIM_CFG_TRGSEL_0      ((uint32_t)0x00002000)  /* Bit 0 */
#define LPTIM_CFG_TRGSEL_1      ((uint32_t)0x00004000)  /* Bit 1 */
#define LPTIM_CFG_TRGSEL_2      ((uint32_t)0x00008000)  /* Bit 2 */
#define LPTIM_CFG_TRGSEL_3      ((uint32_t)0x00010000)  /* Bit 3 */

#define LPTIM_CFG_TRGEN         ((uint32_t)0x00060000)  /* TRGEN[1:0] bits (Trigger enable and polarity) */
#define LPTIM_CFG_TRGEN_0       ((uint32_t)0x00020000)  /* Bit 0 */
#define LPTIM_CFG_TRGEN_1       ((uint32_t)0x00040000)  /* Bit 1 */

#define LPTIM_CFG_TIMOUTEN      ((uint32_t)0x00080000)  /* Timout enable */
#define LPTIM_CFG_WAVE          ((uint32_t)0x00100000)  /* Waveform shape */
#define LPTIM_CFG_WAVEPOL       ((uint32_t)0x00200000)  /* Waveform shape polarity */
#define LPTIM_CFG_RELOAD        ((uint32_t)0x00400000)  /* Reg update mode */
#define LPTIM_CFG_CNTMEN        ((uint32_t)0x00800000)  /* Counter mode enable */
#define LPTIM_CFG_ENC           ((uint32_t)0x01000000)  /* Encoder mode enable */
#define LPTIM_CFG_NENC          ((uint32_t)0x02000000)  /* NONEncoder mode enable */
/** Bit definition for LPTIM_CTRL register **/
#define LPTIM_CTRL_LPTIMEN      ((uint32_t)0x00000001)  /* LPTIMer enable */
#define LPTIM_CTRL_SNGMST       ((uint32_t)0x00000002)  /* Timer start in single mode */
#define LPTIM_CTRL_TSTCM        ((uint32_t)0x00000004)  /* Timer start in continuous mode */

