axfnull/N32G401_CodeLib/firmware/CMSIS/device/n32g401f8s7_1.h
/** Bits definition for RTC_BKP2 register **/
#define RTC_BKP2R     ((uint32_t)0xFFFFFFFF)

/**  Bits definition for RTC_BKP3 register **/
#define RTC_BKP3R     ((uint32_t)0xFFFFFFFF)

/**  Bits definition for RTC_BKP4 register **/
#define RTC_BKP4R     ((uint32_t)0xFFFFFFFF)

/**  Bits definition for RTC_BKP5 register **/
#define RTC_BKP5R     ((uint32_t)0xFFFFFFFF)

/** Bits definition for RTC_BKP6 register **/
#define RTC_BKP6R     ((uint32_t)0xFFFFFFFF)

/** Bits definition for RTC_BKP7 register **/
#define RTC_BKP7R     ((uint32_t)0xFFFFFFFF)

/** Bits definition for RTC_BKP8 register **/
#define RTC_BKP8R     ((uint32_t)0xFFFFFFFF)

/** Bits definition for RTC_BKP9 register **/
#define RTC_BKP9R     ((uint32_t)0xFFFFFFFF)

/** Bits definition for RTC_BKP10 register **/
#define RTC_BKP10R    ((uint32_t)0xFFFFFFFF)

/** Bits definition for RTC_BKP11 register **/
#define RTC_BKP11R    ((uint32_t)0xFFFFFFFF)

/** Bits definition for RTC_BKP12register **/
#define RTC_BKP12R    ((uint32_t)0xFFFFFFFF)

/** Bits definition for RTC_BKP13 register **/
#define RTC_BKP13R    ((uint32_t)0xFFFFFFFF)

/** Bits definition for RTC_BKP14 register **/
#define RTC_BKP14R    ((uint32_t)0xFFFFFFFF)

/** Bits definition for RTC_BKP15 register **/
#define RTC_BKP15R    ((uint32_t)0xFFFFFFFF)

/** Bits definition for RTC_BKP16 register **/
#define RTC_BKP16R    ((uint32_t)0xFFFFFFFF)

/** Bits definition for RTC_BKP17register **/
#define RTC_BKP17R    ((uint32_t)0xFFFFFFFF)

/** Bits definition for RTC_BKP18 register **/
#define RTC_BKP18R    ((uint32_t)0xFFFFFFFF)

/** Bits definition for RTC_BKP19 register **/
#define RTC_BKP19R    ((uint32_t)0xFFFFFFFF)

/** Bits definition for RTC_BKP20 register **/
#define RTC_BKP20R    ((uint32_t)0xFFFFFFFF)


/*** Independent WATCHDOG ***/

/** Bit definition for IWDG_KEY register **/
#define IWDG_KEY_KEYV     ((uint16_t)0xFFFF) /* Key value (write only, read 0000h) */

/** Bit definition for IWDG_PREDIV register **/
#define IWDG_PREDIV_PD    ((uint8_t)0x07)    /* PD[2:0] (Prescaler divider) */
#define IWDG_PREDIV_PD0   ((uint8_t)0x01)    /* Bit 0 */
#define IWDG_PREDIV_PD1   ((uint8_t)0x02)    /* Bit 1 */
#define IWDG_PREDIV_PD2   ((uint8_t)0x04)    /* Bit 2 */

/** Bit definition for IWDG_RELV register **/
#define IWDG_RELV_REL     ((uint16_t)0x0FFF) /* Watchdog counter reload value */

/** Bit definition for IWDG_STS register **/
#define IWDG_STS_PVU      ((uint8_t)0x01)    /* Watchdog prescaler value update */
#define IWDG_STS_CRVU     ((uint8_t)0x02)    /* Watchdog counter reload value update */


/*** Window WATCHDOG ***/

/** Bit definition for WWDG_CTRL register **/
#define WWDG_CTRL_T      ((uint16_t)0x3FFF)     /*T[13:0] bits(14-bit counter (MSB to LSB)) */
#define WWDG_CTRL_T0     ((uint16_t)0x0001)     /* Bit 0  */
#define WWDG_CTRL_T1     ((uint16_t)0x0002)     /* Bit 1  */
#define WWDG_CTRL_T2     ((uint16_t)0x0004)     /* Bit 2  */
#define WWDG_CTRL_T3     ((uint16_t)0x0008)     /* Bit 3  */
#define WWDG_CTRL_T4     ((uint16_t)0x0010)     /* Bit 4  */
#define WWDG_CTRL_T5     ((uint16_t)0x0020)     /* Bit 5  */
#define WWDG_CTRL_T6     ((uint16_t)0x0040)     /* Bit 6  */
#define WWDG_CTRL_T7     ((uint16_t)0x0080)     /* Bit 7  */
#define WWDG_CTRL_T8     ((uint16_t)0x0100)     /* Bit 8  */
#define WWDG_CTRL_T9     ((uint16_t)0x0200)     /* Bit 9  */
#define WWDG_CTRL_T10    ((uint16_t)0x0400)     /* Bit 10 */
#define WWDG_CTRL_T11    ((uint16_t)0x0800)     /* Bit 11 */
#define WWDG_CTRL_T12    ((uint16_t)0x1000)     /* Bit 12 */
#define WWDG_CTRL_T13    ((uint16_t)0x2000)     /* Bit 13 */

#define WWDG_CTRL_ACTB   ((uint16_t)0x4000) /* Activation bit */

/**  Bit definition for WWDG_CFG register **/
#define WWDG_CFG_W       ((uint32_t)0x00003FFF) /* W[13:0] bits (14-bit window value) */
#define WWDG_CFG_W0      ((uint32_t)0x00000001) /* Bit 0 */
#define WWDG_CFG_W1      ((uint32_t)0x00000002) /* Bit 1 */
#define WWDG_CFG_W2      ((uint32_t)0x00000004) /* Bit 2 */
#define WWDG_CFG_W3      ((uint32_t)0x00000008) /* Bit 3 */
#define WWDG_CFG_W4      ((uint32_t)0x00000010) /* Bit 4 */
#define WWDG_CFG_W5      ((uint32_t)0x00000020) /* Bit 5 */
#define WWDG_CFG_W6      ((uint32_t)0x00000040) /* Bit 6 */
#define WWDG_CFG_W7      ((uint32_t)0x00000080) /* Bit 7  */
#define WWDG_CFG_W8      ((uint32_t)0x00000100) /* Bit 8  */
#define WWDG_CFG_W9      ((uint32_t)0x00000200) /* Bit 9  */
#define WWDG_CFG_W10     ((uint32_t)0x00000400) /* Bit 10 */
#define WWDG_CFG_W11     ((uint32_t)0x00000800) /* Bit 11 */
#define WWDG_CFG_W12     ((uint32_t)0x00001000) /* Bit 12 */
#define WWDG_CFG_W13     ((uint32_t)0x00002000) /* Bit 13 */

#define WWDG_CFG_TIMERB  ((uint32_t)0x0000C000) /* WDGTB[1:0] bits (Timer Base) */
#define WWDG_CFG_TIMERB0 ((uint32_t)0x00004000) /* Bit 0 */
#define WWDG_CFG_TIMERB1 ((uint32_t)0x00008000) /* Bit 1 */

#define WWDG_CFG_EWINT   ((uint32_t)0x00010000) /* Early Wakeup Interrupt */

/** Bit definition for WWDG_STS register **/
#define WWDG_STS_EWINTF  ((uint8_t)0x01)        /* Early Wakeup Interrupt Flag */

/*** Serial Peripheral Interface ***/

/** Bit definition for SPI_CTRL1 register **/

#define SPI_CTRL1_CLKPHA    ((uint16_t)0x0001)      /* Clock Phase */
#define SPI_CTRL1_CLKPOL    ((uint16_t)0x0002)      /* Clock Polarity */
#define SPI_CTRL1_MSEL      ((uint16_t)0x0004)      /* Master Selection */

#define SPI_CTRL1_BR        ((uint16_t)0x0038)      /* BR[2:0] bits (Baud Rate Control) */
#define SPI_CTRL1_BR0       ((uint16_t)0x0008)      /* Bit 0 */
#define SPI_CTRL1_BR1       ((uint16_t)0x0010)      /* Bit 1 */
#define SPI_CTRL1_BR2       ((uint16_t)0x0020)      /* Bit 2 */

#define SPI_CTRL1_SPIEN     ((uint16_t)0x0040)      /* SPI Enable */
#define SPI_CTRL1_LSBFF     ((uint16_t)0x0080)      /* Frame Format */
#define SPI_CTRL1_SSEL      ((uint16_t)0x0100)      /* Internal slave select */
#define SPI_CTRL1_SSMEN     ((uint16_t)0x0200)      /* Software slave management */
#define SPI_CTRL1_RONLY     ((uint16_t)0x0400)      /* Receive only */
#define SPI_CTRL1_DATFF     ((uint16_t)0x0800)      /* Data Frame Format */
#define SPI_CTRL1_CRCNEXT   ((uint16_t)0x1000)      /* Transmit CRC next */
#define SPI_CTRL1_CRCEN     ((uint16_t)0x2000)      /* Hardware CRC calculation enable */
#define SPI_CTRL1_BIDIROEN  ((uint16_t)0x4000)      /* Output enable in bidirectional mode */
#define SPI_CTRL1_BIDIRMODE ((uint16_t)0x8000)      /* Bidirectional data mode enable */

/** Bit definition for SPI_CTRL2 register **/ 
#define SPI_CTRL2_RDMAEN    ((uint8_t)0x01)         /* Rx Buffer DMA Enable */
#define SPI_CTRL2_TDMAEN    ((uint8_t)0x02)         /* Tx Buffer DMA Enable */
#define SPI_CTRL2_SSOEN     ((uint8_t)0x04)         /* SS Output Enable */
#define SPI_CTRL2_ERRINTEN  ((uint8_t)0x20)         /* Error Interrupt Enable */
#define SPI_CTRL2_RNEINTEN  ((uint8_t)0x40)         /* RX buffer Not Empty Interrupt Enable */
#define SPI_CTRL2_TEINTEN   ((uint8_t)0x80)         /* Tx buffer Empty Interrupt Enable */

/** Bit definition for SPI_STS register **/   
#define SPI_STS_RNE         ((uint8_t)0x01)         /* Receive buffer Not Empty */
#define SPI_STS_TE          ((uint8_t)0x02)         /* Transmit buffer Empty */
#define SPI_STS_CHSIDE      ((uint8_t)0x04)         /* Channel side */
#define SPI_STS_UNDER       ((uint8_t)0x08)         /* Underrun flag */
#define SPI_STS_CRCERR      ((uint8_t)0x10)         /* CRC Error flag */
#define SPI_STS_MODERR      ((uint8_t)0x20)         /* Mode fault */
#define SPI_STS_OVER        ((uint8_t)0x40)         /* Overrun flag */
#define SPI_STS_BUSY        ((uint8_t)0x80)         /* Busy flag */

/** Bit definition for SPI_DAT register **/
#define SPI_DAT_DAT         ((uint16_t)0xFFFF)      /* Data Register */

/** Bit definition for SPI_CRCPOLY register **/
#define SPI_CRCPOLY_CRCPOLY ((uint16_t)0xFFFF)      /* CRC polynomial register */

/** Bit definition for SPI_CRCRDAT register **/
#define SPI_CRCRDAT_CRCRDAT ((uint16_t)0xFFFF)      /* Rx CRC Register */

/** Bit definition for SPI_CRCTDAT register **/
#define SPI_CRCTDAT_CRCTDAT ((uint16_t)0xFFFF)      /* Tx CRC Register */
    
/** Bit definition for SPI_I2SCFG register **/    
#define SPI_I2SCFG_CHBITS   ((uint16_t)0x0001)      /* Channel length (number of bits per audio channel) */

#define SPI_I2SCFG_TDATLEN  ((uint16_t)0x0006)      /* TDATLEN[1:0] bits (Data length to be transferred) */
#define SPI_I2SCFG_TDATLEN0 ((uint16_t)0x0002)      /* Bit 0 */
#define SPI_I2SCFG_TDATLEN1 ((uint16_t)0x0004)      /* Bit 1 */
    
#define SPI_I2SCFG_CLKPOL   ((uint16_t)0x0008)      /* steady state clock polarity */
    
#define SPI_I2SCFG_STDSEL   ((uint16_t)0x0030)      /* STDSEL[1:0] bits (I2S standard selection) */
#define SPI_I2SCFG_STDSEL0  ((uint16_t)0x0010)      /* Bit 0 */
#define SPI_I2SCFG_STDSEL1  ((uint16_t)0x0020)      /* Bit 1 */
    
