axfnull/N32G401_CodeLib/firmware/CMSIS/device/n32g401f8s7_1.h
#define I2C_TMRISE_SDAAFENN ((uint32_t)0x10000000) /* SDA analog gfilter enable */

#define I2C_TMRISE_SCLAFW   ((uint32_t)0x60000000) /* SCL analog gfilter width selection */
#define I2C_TMRISE_SCLAFW_0 ((uint32_t)0x20000000) /* Bit 0 */
#define I2C_TMRISE_SCLAFW_1 ((uint32_t)0x40000000) /* Bit 1 */

#define I2C_TMRISE_SCLAFENN ((uint32_t)0x80000000) /* SCL analog gfilter enable */


/*** Universal Synchronous Asynchronous Receiver Transmitter ***/

/** Bit definition for USART_STS register **/
#define USART_STS_PEF    ((uint16_t)0x0001) /* Parity Error */
#define USART_STS_FEF    ((uint16_t)0x0002) /* Framing Error */
#define USART_STS_NEF    ((uint16_t)0x0004) /* Noise Error Flag */
#define USART_STS_OREF   ((uint16_t)0x0008) /* OverRun Error */
#define USART_STS_IDLEF  ((uint16_t)0x0010) /* IDLE line detected */
#define USART_STS_RXDNE  ((uint16_t)0x0020) /* Read Data Register Not Empty */
#define USART_STS_TXC    ((uint16_t)0x0040) /* Transmission Complete */
#define USART_STS_TXDE   ((uint16_t)0x0080) /* Transmit Data Register Empty */
#define USART_STS_LINBDF ((uint16_t)0x0100) /* LIN Break Detection Flag */
#define USART_STS_CTSF   ((uint16_t)0x0200) /* CTS Flag */

/** Bit definition for USART_DAT register **/
#define USART_DAT_DATV   ((uint16_t)0x01FF) /* Data value */

/** Bit definition for USART_BRCF register **/
#define USART_BRCF_DIV_Decimal ((uint16_t)0x000F) /* Fraction of USARTDIV */
#define USART_BRCF_DIV_Integer ((uint16_t)0xFFF0) /* Mantissa of USARTDIV */

/** Bit definition for USART_CTRL1 register **/
#define USART_CTRL1_SDBRK    ((uint16_t)0x0001) /* Send Break */
#define USART_CTRL1_RCVWU    ((uint16_t)0x0002) /* Receiver wakeup */
#define USART_CTRL1_RXEN     ((uint16_t)0x0004) /* Receiver Enable */
#define USART_CTRL1_TXEN     ((uint16_t)0x0008) /* Transmitter Enable */
#define USART_CTRL1_IDLEIEN  ((uint16_t)0x0010) /* IDLE Interrupt Enable */
#define USART_CTRL1_RXDNEIEN ((uint16_t)0x0020) /* RXNE Interrupt Enable */
#define USART_CTRL1_TXCIEN   ((uint16_t)0x0040) /* Transmission Complete Interrupt Enable */
#define USART_CTRL1_TXDEIEN  ((uint16_t)0x0080) /* PE Interrupt Enable */
#define USART_CTRL1_PEIEN    ((uint16_t)0x0100) /* PE Interrupt Enable */
#define USART_CTRL1_PSEL     ((uint16_t)0x0200) /* Parity Selection */
#define USART_CTRL1_PCEN     ((uint16_t)0x0400) /* Parity Control Enable */
#define USART_CTRL1_WUM      ((uint16_t)0x0800) /* Wakeup method */
#define USART_CTRL1_WL       ((uint16_t)0x1000) /* Word length */
#define USART_CTRL1_UEN      ((uint16_t)0x2000) /* USART Enable */

/** Bit definition for USART_CTRL2 register **/
#define USART_CTRL2_ADDR        ((uint16_t)0x000F) /* Address of the USART node */
#define USART_CTRL2_LINBDL      ((uint16_t)0x0020) /* LIN Break Detection Length */
#define USART_CTRL2_LINBDIEN    ((uint16_t)0x0040) /* LIN Break Detection Interrupt Enable */
#define USART_CTRL2_LBCLK       ((uint16_t)0x0100) /* Last Bit Clock pulse */
#define USART_CTRL2_CLKPHA      ((uint16_t)0x0200) /* Clock Phase */
#define USART_CTRL2_CLKPOL      ((uint16_t)0x0400) /* Clock Polarity */
#define USART_CTRL2_CLKEN       ((uint16_t)0x0800) /* Clock Enable */

#define USART_CTRL2_STPB   ((uint16_t)0x3000) /* STOP[1:0] bits (STOP bits) */
#define USART_CTRL2_STPB_0 ((uint16_t)0x1000) /* Bit 0 */
#define USART_CTRL2_STPB_1 ((uint16_t)0x2000) /* Bit 1 */

#define USART_CTRL2_LINMEN ((uint16_t)0x4000) /* LIN mode enable */

/** Bit definition for USART_CTRL3 register **/
#define USART_CTRL3_ERRIEN  ((uint16_t)0x0001) /* Error Interrupt Enable */
#define USART_CTRL3_IRDAMEN ((uint16_t)0x0002) /* IrDA mode Enable */
#define USART_CTRL3_IRDALP  ((uint16_t)0x0004) /* IrDA Low-Power */
#define USART_CTRL3_HDMEN   ((uint16_t)0x0008) /* Half-Duplex Selection */
#define USART_CTRL3_SCNACK  ((uint16_t)0x0010) /* Smartcard NACK enable */
#define USART_CTRL3_SCMEN   ((uint16_t)0x0020) /* Smartcard mode enable */
#define USART_CTRL3_DMARXEN ((uint16_t)0x0040) /* DMA Enable Receiver */
#define USART_CTRL3_DMATXEN ((uint16_t)0x0080) /* DMA Enable Transmitter */
#define USART_CTRL3_RTSEN   ((uint16_t)0x0100) /* RTS Enable */
#define USART_CTRL3_CTSEN   ((uint16_t)0x0200) /* CTS Enable */
#define USART_CTRL3_CTSIEN  ((uint16_t)0x0400) /* CTS Interrupt Enable */

/** Bit definition for USART_GTP register **/
#define USART_GTP_PSCV   ((uint16_t)0x00FF) /* PSC[7:0] bits (Prescaler value) */
#define USART_GTP_PSCV_0 ((uint16_t)0x0001) /* Bit 0 */
#define USART_GTP_PSCV_1 ((uint16_t)0x0002) /* Bit 1 */
#define USART_GTP_PSCV_2 ((uint16_t)0x0004) /* Bit 2 */
#define USART_GTP_PSCV_3 ((uint16_t)0x0008) /* Bit 3 */
#define USART_GTP_PSCV_4 ((uint16_t)0x0010) /* Bit 4 */
#define USART_GTP_PSCV_5 ((uint16_t)0x0020) /* Bit 5 */
#define USART_GTP_PSCV_6 ((uint16_t)0x0040) /* Bit 6 */
#define USART_GTP_PSCV_7 ((uint16_t)0x0080) /* Bit 7 */

#define USART_GTP_GTV ((uint16_t)0xFF00) /* Guard time value */


/*** Debug MCU ***/

/** Bit definition for DBG_ID register **/
#define DBG_ID_DEV    ((uint32_t)0x00000FFF) /* Device Identifier */

#define DBG_ID_REV    ((uint32_t)0xFFFF0000) /* REV_ID[15:0] bits (Revision Identifier) */
#define DBG_ID_REV_0  ((uint32_t)0x00010000) /* Bit 0 */
#define DBG_ID_REV_1  ((uint32_t)0x00020000) /* Bit 1 */
#define DBG_ID_REV_2  ((uint32_t)0x00040000) /* Bit 2 */
#define DBG_ID_REV_3  ((uint32_t)0x00080000) /* Bit 3 */
#define DBG_ID_REV_4  ((uint32_t)0x00100000) /* Bit 4 */
#define DBG_ID_REV_5  ((uint32_t)0x00200000) /* Bit 5 */
#define DBG_ID_REV_6  ((uint32_t)0x00400000) /* Bit 6 */
#define DBG_ID_REV_7  ((uint32_t)0x00800000) /* Bit 7 */
#define DBG_ID_REV_8  ((uint32_t)0x01000000) /* Bit 8 */
#define DBG_ID_REV_9  ((uint32_t)0x02000000) /* Bit 9 */
#define DBG_ID_REV_10 ((uint32_t)0x04000000) /* Bit 10 */
#define DBG_ID_REV_11 ((uint32_t)0x08000000) /* Bit 11 */
#define DBG_ID_REV_12 ((uint32_t)0x10000000) /* Bit 12 */
#define DBG_ID_REV_13 ((uint32_t)0x20000000) /* Bit 13 */
#define DBG_ID_REV_14 ((uint32_t)0x40000000) /* Bit 14 */
#define DBG_ID_REV_15 ((uint32_t)0x80000000) /* Bit 15 */

/** Bit definition for DBG_CTRL register **/
#define DBG_CTRL_SLEEP        ((uint32_t)0x00000001) /* Debug Sleep Mode */
#define DBG_CTRL_STOP         ((uint32_t)0x00000002) /* Debug Stop Mode */
#define DBG_CTRL_STDBY        ((uint32_t)0x00000004) /* Debug Standby mode */

#define DBG_CTRL_IWDG_STOP    ((uint32_t)0x00000100) /* Debug Independent Watchdog stopped when Core is halted */
#define DBG_CTRL_WWDG_STOP    ((uint32_t)0x00000200) /* Debug Window Watchdog stopped when Core is halted */
#define DBG_CTRL_TIM1_STOP    ((uint32_t)0x00000400) /* TIM1 counter stopped when core is halted */
#define DBG_CTRL_TIM2_STOP    ((uint32_t)0x00000800) /* TIM2 counter stopped when core is halted */
#define DBG_CTRL_TIM3_STOP    ((uint32_t)0x00001000) /* TIM3 counter stopped when core is halted */
#define DBG_CTRL_TIM4_STOP    ((uint32_t)0x00002000) /* TIM4 counter stopped when core is halted */
#define DBG_CTRL_I2C1SMBUS_TO ((uint32_t)0x00008000) /* SMBUS I2C1 timeout mode stopped when Core is halted */
#define DBG_CTRL_I2C2SMBUS_TO ((uint32_t)0x00010000) /* SMBUS I2C2 timeout mode stopped when Core is halted */
#define DBG_CTRL_TIM8_STOP    ((uint32_t)0x00020000) /* TIM8 counter stopped when core is halted */
#define DBG_CTRL_TIM5_STOP    ((uint32_t)0x00040000) /* TIM5 counter stopped when core is halted */
#define DBG_CTRL_TIM6_STOP    ((uint32_t)0x00080000) /* TIM6 counter stopped when core is halted */


/*** BEEPER Register ***/

/** Bit definition for BEEPER_CTRL register **/
#define BEERPER_CTRL_BEEPEN     ((uint32_t)0x00000001)  /* Bit[0] */
#define BEERPER_CTRL_INVEN      ((uint32_t)0x00000002)  /* Bit[1] */

