axfnull/N32G401_CodeLib/firmware/CMSIS/device/n32g401f8s7_1.h
#define BEEPER_CTRL_CLKSEL      ((uint32_t)0x0000000C)  /* Clock source selection */
#define BEEPER_CTRL_CLKSEL_0    ((uint32_t)0x00000004)  /* Bit[0] */
#define BEEPER_CTRL_CLKSEL_1    ((uint32_t)0x00000008)  /* Bit[1] */

#define BEEPER_CTRL_BEEPDIV     ((uint32_t)0x000001FF0) /* Beeper divide factor */
#define BEEPER_CTRL_BEEPDIV_0   ((uint32_t)0x00000010)  /* Bit[0] */
#define BEEPER_CTRL_BEEPDIV_1   ((uint32_t)0x00000020)  /* Bit[1] */
#define BEEPER_CTRL_BEEPDIV_2   ((uint32_t)0x00000040)  /* Bit[2] */
#define BEEPER_CTRL_BEEPDIV_3   ((uint32_t)0x00000080)  /* Bit[3] */
#define BEEPER_CTRL_BEEPDIV_4   ((uint32_t)0x00000100)  /* Bit[4] */
#define BEEPER_CTRL_BEEPDIV_5   ((uint32_t)0x00000200)  /* Bit[5] */
#define BEEPER_CTRL_BEEPDIV_6   ((uint32_t)0x00000400)  /* Bit[6] */
#define BEEPER_CTRL_BEEPDIV_7   ((uint32_t)0x00000800)  /* Bit[7] */
#define BEEPER_CTRL_BEEPDIV_8   ((uint32_t)0x00001000)  /* Bit[8] */

#define BEEPER_CTRL_BYPASSEN    ((uint32_t)0x00008000)  /* Bypass at second stage with select clock signal */

#define BEEPER_CTRL_PSC         ((uint32_t)0x003F0000)  /* APB clock prescale factor */
#define BEEPER_CTRL_PSC_0       ((uint32_t)0x00010000)  /* Bit[0] */
#define BEEPER_CTRL_PSC_1       ((uint32_t)0x00020000)  /* Bit[1] */
#define BEEPER_CTRL_PSC_2       ((uint32_t)0x00040000)  /* Bit[2] */
#define BEEPER_CTRL_PSC_3       ((uint32_t)0x00080000)  /* Bit[3] */
#define BEEPER_CTRL_PSC_4       ((uint32_t)0x00100000)  /* Bit[4] */
#define BEEPER_CTRL_PSC_5       ((uint32_t)0x00200000)  /* Bit[5] */


/*** FLASH and Option Bytes Registers ***/

/** Bit definition for FLASH_AC register **/
#define FLASH_AC_LATENCY   ((uint8_t)0x07) /* LATENCY[2:0] bits (Latency) */
#define FLASH_AC_LATENCY_0 ((uint8_t)0x00) /* Bit 0 = 0 */
#define FLASH_AC_LATENCY_1 ((uint8_t)0x01) /* Bit 0 = 1 */
#define FLASH_AC_LATENCY_2 ((uint8_t)0x02) /* Bit 0 = 0; Bit 1 = 1 */
#define FLASH_AC_LATENCY_3 ((uint8_t)0x03) /* Bit 0 = 1; Bit 1 = 1 */
#define FLASH_AC_LATENCY_4 ((uint8_t)0x04) /* Bit 0 = 0; Bit 1 = 0; Bit 2 = 1 */

#define FLASH_AC_PRFTBFEN  ((uint8_t)0x10) /* Prefetch Buffer Enable */
#define FLASH_AC_PRFTBFSTS ((uint8_t)0x20) /* Prefetch Buffer Status */
#define FLASH_AC_ICAHRST   ((uint8_t)0x40) /* Icache Reset */
#define FLASH_AC_ICAHEN    ((uint8_t)0x80) /* Icache Enable */

/** Bit definition for FLASH_KEY register **/
#define FLASH_KEY_FKEY ((uint32_t)0xFFFFFFFF) /* FPEC Key */

/** Bit definition for FLASH_OPTKEY register **/
#define FLASH_OPTKEY_OPTKEY ((uint32_t)0xFFFFFFFF) /* Option Byte Key */

/** Bit definition for FLASH_STS register **/
#define FLASH_STS_BUSY     ((uint8_t)0x01) /* Busy */
#define FLASH_STS_PGERR    ((uint8_t)0x04) /* Programming Error */
#define FLASH_STS_WRPERR   ((uint8_t)0x10) /* Write Protection Error */
#define FLASH_STS_EOP      ((uint8_t)0x20) /* End of operation */

/** Bit definition for FLASH_CTRL register **/
#define FLASH_CTRL_PG        ((uint16_t)0x0001) /* Programming */
#define FLASH_CTRL_PER       ((uint16_t)0x0002) /* Page Erase */
#define FLASH_CTRL_MER       ((uint16_t)0x0004) /* Mass Erase */
#define FLASH_CTRL_OPTPG     ((uint16_t)0x0010) /* Option Byte Programming */
#define FLASH_CTRL_OPTER     ((uint16_t)0x0020) /* Option Byte Erase */
#define FLASH_CTRL_START     ((uint16_t)0x0040) /* Start */
#define FLASH_CTRL_LOCK      ((uint16_t)0x0080) /* Lock */
#define FLASH_CTRL_OPTWRE    ((uint16_t)0x0200) /* Option Bytes Write Enable */
#define FLASH_CTRL_ERRITE    ((uint16_t)0x0400) /* Error Interrupt Enable */
#define FLASH_CTRL_EOPITE    ((uint16_t)0x1000) /* End of operation Interrupt Enable */

/** Bit definition for FLASH_ADD register **/
#define FLASH_ADD_FADD ((uint32_t)0xFFFFFFFF) /* Flash Address */

/** Bit definition for FLASH_OB2 register **/
#define FLASH_OB2_nBOOT1   ((uint32_t)0x00800000) /* nBOOT1 */
#define FLASH_OB2_nSWBOOT0 ((uint32_t)0x04000000) /* nSWBOOT0 */
#define FLASH_OB2_nBOOT0   ((uint32_t)0x08000000) /* nBOOT0 */

/** Bit definition for FLASH_OB register **/
#define FLASH_OB_OBERR   ((uint16_t)0x0001) /* Option Byte Error */
#define FLASH_OB_RDPRT1  ((uint16_t)0x0002) /* Read Protection */

#define FLASH_OB_USER       ((uint16_t)0x01FC) /* User Option Bytes */
#define FLASH_OB_WDG_SW     ((uint16_t)0x0004) /* WDG_SW */
#define FLASH_OB_NRST_STOP  ((uint16_t)0x0008) /* nRST_STOP */
#define FLASH_OB_NRST_STDBY ((uint16_t)0x0010) /* nRST_STDBY */

#define FLASH_OB_IWDGSTOP0FRZ    ((uint16_t)0x0020) /* IWDG_STOP0_FRZ */
#define FLASH_OB_IWDGSTOP2FRZ    ((uint16_t)0x0040) /* IWDG_STOP2_FRZ */
#define FLASH_OB_IWDGSTDBYFRZ    ((uint16_t)0x0080) /* IWDG_STDBY_FRZ */
#define FLASH_OB_IWDGSLEEPFRZ    ((uint16_t)0x0100) /* IWDG_SLEEP_FRZ */

#define FLASH_OB_DATA0_MSK ((uint32_t)0x0003FC00) /* Data0 Mask */
#define FLASH_OB_DATA1_MSK ((uint32_t)0x03FC0000) /* Data1 Mask */
#define FLASH_OB_RDPRT2    ((uint32_t)0x80000000) /* Read Protection Level 2 */

/** Bit definition for FLASH_WRP register **/
#define FLASH_WRP_WRPT ((uint16_t)0xFFFF) /* Write Protect */

/** Bit definition for FLASH_CAHR register **/
#define FLASH_CAHR_LOCKSTRT_MSK ((uint32_t)0x0000000F) /* LOCKSTRT Mask */
#define FLASH_CAHR_LOCKSTRT_0   ((uint32_t)0x00000001)
#define FLASH_CAHR_LOCKSTRT_1   ((uint32_t)0x00000002)
#define FLASH_CAHR_LOCKSTRT_2   ((uint32_t)0x00000004)
#define FLASH_CAHR_LOCKSTRT_3   ((uint32_t)0x00000008)

#define FLASH_CAHR_LOCKSTOP_MSK ((uint32_t)0x000000F0) /* LOCKSTOP Mask */
#define FLASH_CAHR_LOCKSTOP_0   ((uint32_t)0x00000010)
#define FLASH_CAHR_LOCKSTOP_1   ((uint32_t)0x00000020)
#define FLASH_CAHR_LOCKSTOP_2   ((uint32_t)0x00000040)
#define FLASH_CAHR_LOCKSTOP_3   ((uint32_t)0x00000080)



/*** Option Bytes register ***/

/** Bit definition for FLASH_RDP register **/
#define FLASH_RDP_RDP1  ((uint32_t)0x000000FF) /* Read protection option byte */
#define FLASH_RDP_NRDP1 ((uint32_t)0x0000FF00) /* Read protection complemented option byte */

/** Bit definition for FLASH_USER register **/
#define FLASH_USER_USER  ((uint32_t)0x00FF0000) /* User option byte */
#define FLASH_USER_NUSER ((uint32_t)0xFF000000) /* User complemented option byte */

/** Bit definition for FLASH_Data0 register **/
#define FLASH_Data0_Data0  ((uint32_t)0x000000FF) /* User data storage option byte */
#define FLASH_Data0_NData0 ((uint32_t)0x0000FF00) /* User data storage complemented option byte */

/** Bit definition for FLASH_Data1 register **/
#define FLASH_Data1_Data1  ((uint32_t)0x00FF0000) /* User data storage option byte */
#define FLASH_Data1_NData1 ((uint32_t)0xFF000000) /* User data storage complemented option byte */

/** Bit definition for FLASH_WRP0 register **/
#define FLASH_WRP0_WRP0  ((uint32_t)0x000000FF) /* Flash memory write protection option bytes */
#define FLASH_WRP0_NWRP0 ((uint32_t)0x0000FF00) /* Flash memory write protection complemented option bytes */

