axfnull/N32G401_CodeLib/firmware/CMSIS/device/n32g401f8s7_1.h
#define GPIO_DS2_Pos               (4)                                   
#define GPIO_DS2_Msk               (0x3 << GPIO_DS2_Pos)         /* 0x00000030 */
#define GPIO_DS2                           GPIO_DS2_Msk          /* 0x00000030 */         
#define GPIO_DS2_0                 (0x0 << GPIO_DS2_Pos)         /* 0x00000000 */
#define GPIO_DS2_1                 (0x1 << GPIO_DS2_Pos)         /* 0x00000010 */
#define GPIO_DS2_2                 (0x2 << GPIO_DS2_Pos)         /* 0x00000020 */
#define GPIO_DS2_3                 (0x3 << GPIO_DS2_Pos)         /* 0x00000030 */

#define GPIO_DS3_Pos               (6)                                   
#define GPIO_DS3_Msk               (0x3 << GPIO_DS3_Pos)         /* 0x000000C0 */
#define GPIO_DS3                           GPIO_DS3_Msk          /* 0x000000C0 */         
#define GPIO_DS3_0                 (0x0 << GPIO_DS3_Pos)         /* 0x00000000 */
#define GPIO_DS3_1                 (0x1 << GPIO_DS3_Pos)         /* 0x00000040 */
#define GPIO_DS3_2                 (0x2 << GPIO_DS3_Pos)         /* 0x00000080 */
#define GPIO_DS3_3                 (0x3 << GPIO_DS3_Pos)         /* 0x000000C0 */

#define GPIO_DS4_Pos               (8)                                   
#define GPIO_DS4_Msk               (0x3 << GPIO_DS4_Pos)         /* 0x00000300 */
#define GPIO_DS4                           GPIO_DS4_Msk          /* 0x00000300 */         
#define GPIO_DS4_0                 (0x0 << GPIO_DS4_Pos)         /* 0x00000000 */
#define GPIO_DS4_1                 (0x1 << GPIO_DS4_Pos)         /* 0x00000100 */
#define GPIO_DS4_2                 (0x2 << GPIO_DS4_Pos)         /* 0x00000200 */
#define GPIO_DS4_3                 (0x3 << GPIO_DS4_Pos)         /* 0x00000300 */

#define GPIO_DS5_Pos               (10)                                   
#define GPIO_DS5_Msk               (0x3 << GPIO_DS5_Pos)         /* 0x00000C00 */
#define GPIO_DS5                           GPIO_DS5_Msk          /* 0x00000C00 */         
#define GPIO_DS5_0                 (0x0 << GPIO_DS5_Pos)         /* 0x00000000 */
#define GPIO_DS5_1                 (0x1 << GPIO_DS5_Pos)         /* 0x00000400 */
#define GPIO_DS5_2                 (0x2 << GPIO_DS5_Pos)         /* 0x00000800 */
#define GPIO_DS5_3                 (0x3 << GPIO_DS5_Pos)         /* 0x00000C00 */

#define GPIO_DS6_Pos               (12)                                   
#define GPIO_DS6_Msk               (0x3 << GPIO_DS6_Pos)         /* 0x00003000 */
#define GPIO_DS6                           GPIO_DS6_Msk          /* 0x00003000 */         
#define GPIO_DS6_0                 (0x0 << GPIO_DS6_Pos)         /* 0x00000000 */
#define GPIO_DS6_1                 (0x1 << GPIO_DS6_Pos)         /* 0x00001000 */
#define GPIO_DS6_2                 (0x2 << GPIO_DS6_Pos)         /* 0x00002000 */
#define GPIO_DS6_3                 (0x3 << GPIO_DS6_Pos)         /* 0x00003000 */

#define GPIO_DS7_Pos               (14)                                   
#define GPIO_DS7_Msk               (0x3 << GPIO_DS7_Pos)         /* 0x0000C000 */
#define GPIO_DS7                           GPIO_DS7_Msk          /* 0x0000C000 */         
#define GPIO_DS7_0                 (0x0 << GPIO_DS7_Pos)         /* 0x00000000 */
#define GPIO_DS7_1                 (0x1 << GPIO_DS7_Pos)         /* 0x00004000 */
#define GPIO_DS7_2                 (0x2 << GPIO_DS7_Pos)         /* 0x00008000 */
#define GPIO_DS7_3                 (0x3 << GPIO_DS7_Pos)         /* 0x0000C000 */


#define GPIO_DS8_Pos               (16)                                   
#define GPIO_DS8_Msk               (0x3 << GPIO_DS8_Pos)         /* 0x00030000 */
#define GPIO_DS8                           GPIO_DS8_Msk          /* 0x00030000 */         
#define GPIO_DS8_0                 (0x0 << GPIO_DS8_Pos)         /* 0x00000000 */
#define GPIO_DS8_1                 (0x1 << GPIO_DS8_Pos)         /* 0x00010000 */
#define GPIO_DS8_2                 (0x2 << GPIO_DS8_Pos)         /* 0x00020000 */
#define GPIO_DS8_3                 (0x3 << GPIO_DS8_Pos)         /* 0x00030000 */

#define GPIO_DS9_Pos               (18)                                   
#define GPIO_DS9_Msk               (0x3 << GPIO_DS9_Pos)         /* 0x000C0000 */
#define GPIO_DS9                           GPIO_DS9_Msk          /* 0x000C0000 */         
#define GPIO_DS9_0                 (0x0 << GPIO_DS9_Pos)         /* 0x00000000 */
#define GPIO_DS9_1                 (0x1 << GPIO_DS9_Pos)         /* 0x00040000 */
#define GPIO_DS9_2                 (0x2 << GPIO_DS9_Pos)         /* 0x00080000 */
#define GPIO_DS9_3                 (0x3 << GPIO_DS9_Pos)         /* 0x000C0000 */

#define GPIO_DS10_Pos              (20)                                   
#define GPIO_DS10_Msk              (0x3 << GPIO_DS10_Pos)        /* 0x00300000 */
#define GPIO_DS10                          GPIO_DS10_Msk         /* 0x00300000 */          
#define GPIO_DS10_0                (0x0 << GPIO_DS10_Pos)        /* 0x00000000 */
#define GPIO_DS10_1                (0x1 << GPIO_DS10_Pos)        /* 0x00100000 */
#define GPIO_DS10_2                (0x2 << GPIO_DS10_Pos)        /* 0x00200000 */
#define GPIO_DS10_3                (0x3 << GPIO_DS10_Pos)        /* 0x00300000 */

#define GPIO_DS11_Pos              (22)                                   
#define GPIO_DS11_Msk              (0x3 << GPIO_DS11_Pos)        /* 0x00C00000 */
#define GPIO_DS11                          GPIO_DS11_Msk         /* 0x00C00000 */          
#define GPIO_DS11_0                (0x0 << GPIO_DS11_Pos)        /* 0x00000000 */
#define GPIO_DS11_1                (0x1 << GPIO_DS11_Pos)        /* 0x00400000 */
#define GPIO_DS11_2                (0x2 << GPIO_DS11_Pos)        /* 0x00800000 */
#define GPIO_DS11_3                (0x3 << GPIO_DS11_Pos)        /* 0x00C00000 */

#define GPIO_DS12_Pos              (24)                                   
#define GPIO_DS12_Msk              (0x3 << GPIO_DS12_Pos)        /* 0x03000000 */
#define GPIO_DS12                          GPIO_DS12_Msk         /* 0x03000000 */          
#define GPIO_DS12_0                (0x0 << GPIO_DS12_Pos)        /* 0x00000000 */
#define GPIO_DS12_1                (0x1 << GPIO_DS12_Pos)        /* 0x01000000 */
#define GPIO_DS12_2                (0x2 << GPIO_DS12_Pos)        /* 0x02000000 */
#define GPIO_DS12_3                (0x3 << GPIO_DS12_Pos)        /* 0x03000000 */

#define GPIO_DS13_Pos              (26)                                   
#define GPIO_DS13_Msk              (0x3 << GPIO_DS13_Pos)        /* 0x0C000000 */
#define GPIO_DS13                          GPIO_DS13_Msk         /* 0x0C000000 */          
#define GPIO_DS13_0                (0x0 << GPIO_DS13_Pos)        /* 0x00000000 */
#define GPIO_DS13_1                (0x1 << GPIO_DS13_Pos)        /* 0x04000000 */
#define GPIO_DS13_2                (0x2 << GPIO_DS13_Pos)        /* 0x08000000 */
#define GPIO_DS13_3                (0x3 << GPIO_DS13_Pos)        /* 0x0C000000 */

#define GPIO_DS14_Pos              (28)                                   
#define GPIO_DS14_Msk              (0x3 << GPIO_DS14_Pos)        /* 0x30000000 */
#define GPIO_DS14                          GPIO_DS14_Msk         /* 0x30000000 */          
#define GPIO_DS14_0                (0x0 << GPIO_DS14_Pos)        /* 0x00000000 */
#define GPIO_DS14_1                (0x1 << GPIO_DS14_Pos)        /* 0x10000000 */
#define GPIO_DS14_2                (0x2 << GPIO_DS14_Pos)        /* 0x20000000 */
#define GPIO_DS14_3                (0x3 << GPIO_DS14_Pos)        /* 0x30000000 */

#define GPIO_DS15_Pos              (30)                                   
#define GPIO_DS15_Msk              (0x3 << GPIO_DS15_Pos)        /* 0xC0000000 */
#define GPIO_DS15                          GPIO_DS15_Msk         /* 0xC0000000 */          
#define GPIO_DS15_0                (0x0 << GPIO_DS15_Pos)        /* 0x00000000 */
#define GPIO_DS15_1                (0x1 << GPIO_DS15_Pos)        /* 0x40000000 */
#define GPIO_DS15_2                (0x2 << GPIO_DS15_Pos)        /* 0x80000000 */
#define GPIO_DS15_3                (0x3 << GPIO_DS15_Pos)        /* 0xC0000000 */


