axfnull/N32G401_CodeLib/firmware/CMSIS/device/n32g401f8s7_1.h
/** EXTI4 configuration **/
#define AFIO_EXTI_CFG2_EXTI4_PA0   ((uint32_t)0x00000000) /* PA[0] pin */
#define AFIO_EXTI_CFG2_EXTI4_PB0   ((uint32_t)0x00000001) /* PB[0] pin */
#define AFIO_EXTI_CFG2_EXTI4_PD0   ((uint32_t)0x00000003) /* PD[0] pin */
#define AFIO_EXTI_CFG2_EXTI4_PA1   ((uint32_t)0x00000004) /* PA[1] pin */
#define AFIO_EXTI_CFG2_EXTI4_PB1   ((uint32_t)0x00000005) /* PB[1] pin */
#define AFIO_EXTI_CFG2_EXTI4_PA2   ((uint32_t)0x00000008) /* PA[2] pin */
#define AFIO_EXTI_CFG2_EXTI4_PB2   ((uint32_t)0x00000009) /* PB[2] pin */
#define AFIO_EXTI_CFG2_EXTI4_PA3   ((uint32_t)0x0000000C) /* PA[3] pin */
#define AFIO_EXTI_CFG2_EXTI4_PB3   ((uint32_t)0x0000000D) /* PB[3] pin */
#define AFIO_EXTI_CFG2_EXTI4_PA4   ((uint32_t)0x00000010) /* PA[4] pin */
#define AFIO_EXTI_CFG2_EXTI4_PB4   ((uint32_t)0x00000011) /* PB[4] pin */
#define AFIO_EXTI_CFG2_EXTI4_PA5   ((uint32_t)0x00000014) /* PA[5] pin */
#define AFIO_EXTI_CFG2_EXTI4_PB5   ((uint32_t)0x00000015) /* PB[5] pin */
#define AFIO_EXTI_CFG2_EXTI4_PA6   ((uint32_t)0x00000018) /* PA[6] pin */
#define AFIO_EXTI_CFG2_EXTI4_PB6   ((uint32_t)0x00000019) /* PB[6] pin */
#define AFIO_EXTI_CFG2_EXTI4_PA7   ((uint32_t)0x0000001C) /* PA[7] pin */
#define AFIO_EXTI_CFG2_EXTI4_PB7   ((uint32_t)0x0000001D) /* PB[7] pin */
#define AFIO_EXTI_CFG2_EXTI4_PA8   ((uint32_t)0x00000020) /* PA[8] pin */
#define AFIO_EXTI_CFG2_EXTI4_PB8   ((uint32_t)0x00000021) /* PB[8] pin */
#define AFIO_EXTI_CFG2_EXTI4_PA9   ((uint32_t)0x00000024) /* PA[9] pin */
#define AFIO_EXTI_CFG2_EXTI4_PB9   ((uint32_t)0x00000025) /* PB[9] pin */
#define AFIO_EXTI_CFG2_EXTI4_PA10  ((uint32_t)0x00000028) /* PA[10] pin */
#define AFIO_EXTI_CFG2_EXTI4_PB10  ((uint32_t)0x00000029) /* PB[10] pin */
#define AFIO_EXTI_CFG2_EXTI4_PA11  ((uint32_t)0x0000002C) /* PA[11] pin */
#define AFIO_EXTI_CFG2_EXTI4_PB11  ((uint32_t)0x0000002D) /* PB[11] pin */
#define AFIO_EXTI_CFG2_EXTI4_PA12  ((uint32_t)0x00000030) /* PA[12] pin */
#define AFIO_EXTI_CFG2_EXTI4_PB12  ((uint32_t)0x00000031) /* PB[12] pin */
#define AFIO_EXTI_CFG2_EXTI4_PD12  ((uint32_t)0x00000033) /* PD[12] pin */
#define AFIO_EXTI_CFG2_EXTI4_PA13  ((uint32_t)0x00000034) /* PA[13] pin */
#define AFIO_EXTI_CFG2_EXTI4_PB13  ((uint32_t)0x00000035) /* PB[13] pin */
#define AFIO_EXTI_CFG2_EXTI4_PC13  ((uint32_t)0x00000036) /* PC[13] pin */
#define AFIO_EXTI_CFG2_EXTI4_PD13  ((uint32_t)0x00000037) /* PD[13] pin */
#define AFIO_EXTI_CFG2_EXTI4_PA14  ((uint32_t)0x00000038) /* PA[14] pin */
#define AFIO_EXTI_CFG2_EXTI4_PB14  ((uint32_t)0x00000039) /* PB[14] pin */
#define AFIO_EXTI_CFG2_EXTI4_PC14  ((uint32_t)0x0000003A) /* PC[14] pin */
#define AFIO_EXTI_CFG2_EXTI4_PD14  ((uint32_t)0x0000003B) /* PD[14] pin */
#define AFIO_EXTI_CFG2_EXTI4_PA15  ((uint32_t)0x0000003C) /* PA[15] pin */
#define AFIO_EXTI_CFG2_EXTI4_PB15  ((uint32_t)0x0000003D) /* PB[15] pin */
#define AFIO_EXTI_CFG2_EXTI4_PC15  ((uint32_t)0x0000003E) /* PC[15] pin */
#define AFIO_EXTI_CFG2_EXTI4_PD15  ((uint32_t)0x0000003F) /* PD[15] pin */

/** EXTI5 configuration **/
#define AFIO_EXTI_CFG2_EXTI5_PA0   ((uint32_t)0x00000000) /* PA[0] pin */
#define AFIO_EXTI_CFG2_EXTI5_PB0   ((uint32_t)0x00000100) /* PB[0] pin */
#define AFIO_EXTI_CFG2_EXTI5_PD0   ((uint32_t)0x00000300) /* PD[0] pin */
#define AFIO_EXTI_CFG2_EXTI5_PA1   ((uint32_t)0x00000400) /* PA[1] pin */
#define AFIO_EXTI_CFG2_EXTI5_PB1   ((uint32_t)0x00000500) /* PB[1] pin */
#define AFIO_EXTI_CFG2_EXTI5_PA2   ((uint32_t)0x00000800) /* PA[2] pin */
#define AFIO_EXTI_CFG2_EXTI5_PB2   ((uint32_t)0x00000900) /* PB[2] pin */
#define AFIO_EXTI_CFG2_EXTI5_PA3   ((uint32_t)0x00000C00) /* PA[3] pin */
#define AFIO_EXTI_CFG2_EXTI5_PB3   ((uint32_t)0x00000D00) /* PB[3] pin */
#define AFIO_EXTI_CFG2_EXTI5_PA4   ((uint32_t)0x00001000) /* PA[4] pin */
#define AFIO_EXTI_CFG2_EXTI5_PB4   ((uint32_t)0x00001100) /* PB[4] pin */
#define AFIO_EXTI_CFG2_EXTI5_PA5   ((uint32_t)0x00001400) /* PA[5] pin */
#define AFIO_EXTI_CFG2_EXTI5_PB5   ((uint32_t)0x00001500) /* PB[5] pin */
#define AFIO_EXTI_CFG2_EXTI5_PA6   ((uint32_t)0x00001800) /* PA[6] pin */
#define AFIO_EXTI_CFG2_EXTI5_PB6   ((uint32_t)0x00001900) /* PB[6] pin */
#define AFIO_EXTI_CFG2_EXTI5_PA7   ((uint32_t)0x00001C00) /* PA[7] pin */
#define AFIO_EXTI_CFG2_EXTI5_PB7   ((uint32_t)0x00001D00) /* PB[7] pin */
#define AFIO_EXTI_CFG2_EXTI5_PA8   ((uint32_t)0x00002000) /* PA[8] pin */
#define AFIO_EXTI_CFG2_EXTI5_PB8   ((uint32_t)0x00002100) /* PB[8] pin */
#define AFIO_EXTI_CFG2_EXTI5_PA9   ((uint32_t)0x00002400) /* PA[9] pin */
#define AFIO_EXTI_CFG2_EXTI5_PB9   ((uint32_t)0x00002500) /* PB[9] pin */
#define AFIO_EXTI_CFG2_EXTI5_PA10  ((uint32_t)0x00002800) /* PA[10] pin */
#define AFIO_EXTI_CFG2_EXTI5_PB10  ((uint32_t)0x00002900) /* PB[10] pin */
#define AFIO_EXTI_CFG2_EXTI5_PA11  ((uint32_t)0x00002C00) /* PA[11] pin */
#define AFIO_EXTI_CFG2_EXTI5_PB11  ((uint32_t)0x00002D00) /* PB[11] pin */
#define AFIO_EXTI_CFG2_EXTI5_PA12  ((uint32_t)0x00003000) /* PA[12] pin */
#define AFIO_EXTI_CFG2_EXTI5_PB12  ((uint32_t)0x00003100) /* PB[12] pin */
#define AFIO_EXTI_CFG2_EXTI5_PD12  ((uint32_t)0x00003300) /* PD[12] pin */
#define AFIO_EXTI_CFG2_EXTI5_PA13  ((uint32_t)0x00003400) /* PA[13] pin */
#define AFIO_EXTI_CFG2_EXTI5_PB13  ((uint32_t)0x00003500) /* PB[13] pin */
#define AFIO_EXTI_CFG2_EXTI5_PC13  ((uint32_t)0x00003600) /* PC[13] pin */
#define AFIO_EXTI_CFG2_EXTI5_PD13  ((uint32_t)0x00003700) /* PD[13] pin */
#define AFIO_EXTI_CFG2_EXTI5_PA14  ((uint32_t)0x00003800) /* PA[14] pin */
#define AFIO_EXTI_CFG2_EXTI5_PB14  ((uint32_t)0x00003900) /* PB[14] pin */
#define AFIO_EXTI_CFG2_EXTI5_PC14  ((uint32_t)0x00003A00) /* PC[14] pin */
#define AFIO_EXTI_CFG2_EXTI5_PD14  ((uint32_t)0x00003B00) /* PD[14] pin */
#define AFIO_EXTI_CFG2_EXTI5_PA15  ((uint32_t)0x00003C00) /* PA[15] pin */
#define AFIO_EXTI_CFG2_EXTI5_PB15  ((uint32_t)0x00003D00) /* PB[15] pin */
#define AFIO_EXTI_CFG2_EXTI5_PC15  ((uint32_t)0x00003E00) /* PC[15] pin */
#define AFIO_EXTI_CFG2_EXTI5_PD15  ((uint32_t)0x00003F00) /* PD[15] pin */

/** EXTI6 configuration **/
#define AFIO_EXTI_CFG2_EXTI6_PA0   ((uint32_t)0x00000000) /* PA[0] pin */
#define AFIO_EXTI_CFG2_EXTI6_PB0   ((uint32_t)0x00010000) /* PB[0] pin */
#define AFIO_EXTI_CFG2_EXTI6_PD0   ((uint32_t)0x00030000) /* PD[0] pin */
#define AFIO_EXTI_CFG2_EXTI6_PA1   ((uint32_t)0x00040000) /* PA[1] pin */
#define AFIO_EXTI_CFG2_EXTI6_PB1   ((uint32_t)0x00050000) /* PB[1] pin */
#define AFIO_EXTI_CFG2_EXTI6_PA2   ((uint32_t)0x00080000) /* PA[2] pin */
#define AFIO_EXTI_CFG2_EXTI6_PB2   ((uint32_t)0x00090000) /* PB[2] pin */
#define AFIO_EXTI_CFG2_EXTI6_PA3   ((uint32_t)0x000C0000) /* PA[3] pin */
#define AFIO_EXTI_CFG2_EXTI6_PB3   ((uint32_t)0x000D0000) /* PB[3] pin */
#define AFIO_EXTI_CFG2_EXTI6_PA4   ((uint32_t)0x00100000) /* PA[4] pin */
#define AFIO_EXTI_CFG2_EXTI6_PB4   ((uint32_t)0x00110000) /* PB[4] pin */
#define AFIO_EXTI_CFG2_EXTI6_PA5   ((uint32_t)0x00140000) /* PA[5] pin */
#define AFIO_EXTI_CFG2_EXTI6_PB5   ((uint32_t)0x00150000) /* PB[5] pin */
#define AFIO_EXTI_CFG2_EXTI6_PA6   ((uint32_t)0x00180000) /* PA[6] pin */
#define AFIO_EXTI_CFG2_EXTI6_PB6   ((uint32_t)0x00190000) /* PB[6] pin */
#define AFIO_EXTI_CFG2_EXTI6_PA7   ((uint32_t)0x001C0000) /* PA[7] pin */
#define AFIO_EXTI_CFG2_EXTI6_PB7   ((uint32_t)0x001D0000) /* PB[7] pin */
#define AFIO_EXTI_CFG2_EXTI6_PA8   ((uint32_t)0x00200000) /* PA[8] pin */
#define AFIO_EXTI_CFG2_EXTI6_PB8   ((uint32_t)0x00210000) /* PB[8] pin */
#define AFIO_EXTI_CFG2_EXTI6_PA9   ((uint32_t)0x00240000) /* PA[9] pin */
#define AFIO_EXTI_CFG2_EXTI6_PB9   ((uint32_t)0x00250000) /* PB[9] pin */
#define AFIO_EXTI_CFG2_EXTI6_PA10  ((uint32_t)0x00280000) /* PA[10] pin */
#define AFIO_EXTI_CFG2_EXTI6_PB10  ((uint32_t)0x00290000) /* PB[10] pin */
#define AFIO_EXTI_CFG2_EXTI6_PA11  ((uint32_t)0x002C0000) /* PA[11] pin */
#define AFIO_EXTI_CFG2_EXTI6_PB11  ((uint32_t)0x002D0000) /* PB[11] pin */
#define AFIO_EXTI_CFG2_EXTI6_PA12  ((uint32_t)0x00300000) /* PA[12] pin */
#define AFIO_EXTI_CFG2_EXTI6_PB12  ((uint32_t)0x00310000) /* PB[12] pin */
#define AFIO_EXTI_CFG2_EXTI6_PD12  ((uint32_t)0x00330000) /* PD[12] pin */
#define AFIO_EXTI_CFG2_EXTI6_PA13  ((uint32_t)0x00340000) /* PA[13] pin */
#define AFIO_EXTI_CFG2_EXTI6_PB13  ((uint32_t)0x00350000) /* PB[13] pin */
#define AFIO_EXTI_CFG2_EXTI6_PC13  ((uint32_t)0x00360000) /* PC[13] pin */
#define AFIO_EXTI_CFG2_EXTI6_PD13  ((uint32_t)0x00370000) /* PD[13] pin */
#define AFIO_EXTI_CFG2_EXTI6_PA14  ((uint32_t)0x00380000) /* PA[14] pin */
#define AFIO_EXTI_CFG2_EXTI6_PB14  ((uint32_t)0x00390000) /* PB[14] pin */
#define AFIO_EXTI_CFG2_EXTI6_PC14  ((uint32_t)0x003A0000) /* PC[14] pin */
#define AFIO_EXTI_CFG2_EXTI6_PD14  ((uint32_t)0x003B0000) /* PD[14] pin */
#define AFIO_EXTI_CFG2_EXTI6_PA15  ((uint32_t)0x003C0000) /* PA[15] pin */
#define AFIO_EXTI_CFG2_EXTI6_PB15  ((uint32_t)0x003D0000) /* PB[15] pin */
#define AFIO_EXTI_CFG2_EXTI6_PC15  ((uint32_t)0x003E0000) /* PC[15] pin */
#define AFIO_EXTI_CFG2_EXTI6_PD15  ((uint32_t)0x003F0000) /* PD[15] pin */

/** EXTI7 configuration **/
#define AFIO_EXTI_CFG2_EXTI7_PA0   ((uint32_t)0x00000000) /* PA[0] pin */
#define AFIO_EXTI_CFG2_EXTI7_PB0   ((uint32_t)0x01000000) /* PB[0] pin */
#define AFIO_EXTI_CFG2_EXTI7_PD0   ((uint32_t)0x03000000) /* PD[0] pin */
#define AFIO_EXTI_CFG2_EXTI7_PA1   ((uint32_t)0x04000000) /* PA[1] pin */
#define AFIO_EXTI_CFG2_EXTI7_PB1   ((uint32_t)0x05000000) /* PB[1] pin */
#define AFIO_EXTI_CFG2_EXTI7_PA2   ((uint32_t)0x08000000) /* PA[2] pin */
#define AFIO_EXTI_CFG2_EXTI7_PB2   ((uint32_t)0x09000000) /* PB[2] pin */
#define AFIO_EXTI_CFG2_EXTI7_PA3   ((uint32_t)0x0C000000) /* PA[3] pin */
#define AFIO_EXTI_CFG2_EXTI7_PB3   ((uint32_t)0x0D000000) /* PB[3] pin */
#define AFIO_EXTI_CFG2_EXTI7_PA4   ((uint32_t)0x10000000) /* PA[4] pin */
#define AFIO_EXTI_CFG2_EXTI7_PB4   ((uint32_t)0x11000000) /* PB[4] pin */
#define AFIO_EXTI_CFG2_EXTI7_PA5   ((uint32_t)0x14000000) /* PA[5] pin */
#define AFIO_EXTI_CFG2_EXTI7_PB5   ((uint32_t)0x15000000) /* PB[5] pin */
#define AFIO_EXTI_CFG2_EXTI7_PA6   ((uint32_t)0x18000000) /* PA[6] pin */
#define AFIO_EXTI_CFG2_EXTI7_PB6   ((uint32_t)0x19000000) /* PB[6] pin */
#define AFIO_EXTI_CFG2_EXTI7_PA7   ((uint32_t)0x1C000000) /* PA[7] pin */
#define AFIO_EXTI_CFG2_EXTI7_PB7   ((uint32_t)0x1D000000) /* PB[7] pin */
#define AFIO_EXTI_CFG2_EXTI7_PA8   ((uint32_t)0x20000000) /* PA[8] pin */
#define AFIO_EXTI_CFG2_EXTI7_PB8   ((uint32_t)0x21000000) /* PB[8] pin */
#define AFIO_EXTI_CFG2_EXTI7_PA9   ((uint32_t)0x24000000) /* PA[9] pin */
#define AFIO_EXTI_CFG2_EXTI7_PB9   ((uint32_t)0x25000000) /* PB[9] pin */
#define AFIO_EXTI_CFG2_EXTI7_PA10  ((uint32_t)0x28000000) /* PA[10] pin */
#define AFIO_EXTI_CFG2_EXTI7_PB10  ((uint32_t)0x29000000) /* PB[10] pin */
#define AFIO_EXTI_CFG2_EXTI7_PA11  ((uint32_t)0x2C000000) /* PA[11] pin */
#define AFIO_EXTI_CFG2_EXTI7_PB11  ((uint32_t)0x2D000000) /* PB[11] pin */
#define AFIO_EXTI_CFG2_EXTI7_PA12  ((uint32_t)0x30000000) /* PA[12] pin */
#define AFIO_EXTI_CFG2_EXTI7_PB12  ((uint32_t)0x31000000) /* PB[12] pin */
#define AFIO_EXTI_CFG2_EXTI7_PD12  ((uint32_t)0x33000000) /* PD[12] pin */
#define AFIO_EXTI_CFG2_EXTI7_PA13  ((uint32_t)0x34000000) /* PA[13] pin */
#define AFIO_EXTI_CFG2_EXTI7_PB13  ((uint32_t)0x35000000) /* PB[13] pin */
#define AFIO_EXTI_CFG2_EXTI7_PC13  ((uint32_t)0x36000000) /* PC[13] pin */
#define AFIO_EXTI_CFG2_EXTI7_PD13  ((uint32_t)0x37000000) /* PD[13] pin */
#define AFIO_EXTI_CFG2_EXTI7_PA14  ((uint32_t)0x38000000) /* PA[14] pin */
#define AFIO_EXTI_CFG2_EXTI7_PB14  ((uint32_t)0x39000000) /* PB[14] pin */
#define AFIO_EXTI_CFG2_EXTI7_PC14  ((uint32_t)0x3A000000) /* PC[14] pin */
#define AFIO_EXTI_CFG2_EXTI7_PD14  ((uint32_t)0x3B000000) /* PD[14] pin */
#define AFIO_EXTI_CFG2_EXTI7_PA15  ((uint32_t)0x3C000000) /* PA[15] pin */
#define AFIO_EXTI_CFG2_EXTI7_PB15  ((uint32_t)0x3D000000) /* PB[15] pin */
#define AFIO_EXTI_CFG2_EXTI7_PC15  ((uint32_t)0x3E000000) /* PC[15] pin */
#define AFIO_EXTI_CFG2_EXTI7_PD15  ((uint32_t)0x3F000000) /* PD[15] pin */

/** Bit definition for AFIO_EXTI_CFG3 register **/
#define AFIO_EXTI_CFG3_EXTI8       ((uint32_t)0x0000003F) /* EXTI 8  configuration */
#define AFIO_EXTI_CFG3_EXTI9       ((uint32_t)0x00003F00) /* EXTI 9  configuration */
#define AFIO_EXTI_CFG3_EXTI10      ((uint32_t)0x003F0000) /* EXTI 10 configuration */
#define AFIO_EXTI_CFG3_EXTI11      ((uint32_t)0x3F000000) /* EXTI 11 configuration */

/** EXTI8 configuration **/
#define AFIO_EXTI_CFG3_EXTI8_PA0   ((uint32_t)0x00000000) /* PA[0] pin */
#define AFIO_EXTI_CFG3_EXTI8_PB0   ((uint32_t)0x00000001) /* PB[0] pin */
#define AFIO_EXTI_CFG3_EXTI8_PD0   ((uint32_t)0x00000003) /* PD[0] pin */
#define AFIO_EXTI_CFG3_EXTI8_PA1   ((uint32_t)0x00000004) /* PA[1] pin */
#define AFIO_EXTI_CFG3_EXTI8_PB1   ((uint32_t)0x00000005) /* PB[1] pin */
#define AFIO_EXTI_CFG3_EXTI8_PA2   ((uint32_t)0x00000008) /* PA[2] pin */
#define AFIO_EXTI_CFG3_EXTI8_PB2   ((uint32_t)0x00000009) /* PB[2] pin */
#define AFIO_EXTI_CFG3_EXTI8_PA3   ((uint32_t)0x0000000C) /* PA[3] pin */
#define AFIO_EXTI_CFG3_EXTI8_PB3   ((uint32_t)0x0000000D) /* PB[3] pin */
#define AFIO_EXTI_CFG3_EXTI8_PA4   ((uint32_t)0x00000010) /* PA[4] pin */
#define AFIO_EXTI_CFG3_EXTI8_PB4   ((uint32_t)0x00000011) /* PB[4] pin */
#define AFIO_EXTI_CFG3_EXTI8_PA5   ((uint32_t)0x00000014) /* PA[5] pin */
#define AFIO_EXTI_CFG3_EXTI8_PB5   ((uint32_t)0x00000015) /* PB[5] pin */
#define AFIO_EXTI_CFG3_EXTI8_PA6   ((uint32_t)0x00000018) /* PA[6] pin */
#define AFIO_EXTI_CFG3_EXTI8_PB6   ((uint32_t)0x00000019) /* PB[6] pin */
#define AFIO_EXTI_CFG3_EXTI8_PA7   ((uint32_t)0x0000001C) /* PA[7] pin */
#define AFIO_EXTI_CFG3_EXTI8_PB7   ((uint32_t)0x0000001D) /* PB[7] pin */
#define AFIO_EXTI_CFG3_EXTI8_PA8   ((uint32_t)0x00000020) /* PA[8] pin */
#define AFIO_EXTI_CFG3_EXTI8_PB8   ((uint32_t)0x00000021) /* PB[8] pin */
#define AFIO_EXTI_CFG3_EXTI8_PA9   ((uint32_t)0x00000024) /* PA[9] pin */
#define AFIO_EXTI_CFG3_EXTI8_PB9   ((uint32_t)0x00000025) /* PB[9] pin */
#define AFIO_EXTI_CFG3_EXTI8_PA10  ((uint32_t)0x00000028) /* PA[10] pin */
#define AFIO_EXTI_CFG3_EXTI8_PB10  ((uint32_t)0x00000029) /* PB[10] pin */
#define AFIO_EXTI_CFG3_EXTI8_PA11  ((uint32_t)0x0000002C) /* PA[11] pin */
#define AFIO_EXTI_CFG3_EXTI8_PB11  ((uint32_t)0x0000002D) /* PB[11] pin */
#define AFIO_EXTI_CFG3_EXTI8_PA12  ((uint32_t)0x00000030) /* PA[12] pin */
#define AFIO_EXTI_CFG3_EXTI8_PB12  ((uint32_t)0x00000031) /* PB[12] pin */
#define AFIO_EXTI_CFG3_EXTI8_PD12  ((uint32_t)0x00000033) /* PD[12] pin */
#define AFIO_EXTI_CFG3_EXTI8_PA13  ((uint32_t)0x00000034) /* PA[13] pin */
#define AFIO_EXTI_CFG3_EXTI8_PB13  ((uint32_t)0x00000035) /* PB[13] pin */
#define AFIO_EXTI_CFG3_EXTI8_PC13  ((uint32_t)0x00000036) /* PC[13] pin */
#define AFIO_EXTI_CFG3_EXTI8_PD13  ((uint32_t)0x00000037) /* PD[13] pin */
#define AFIO_EXTI_CFG3_EXTI8_PA14  ((uint32_t)0x00000038) /* PA[14] pin */
#define AFIO_EXTI_CFG3_EXTI8_PB14  ((uint32_t)0x00000039) /* PB[14] pin */
#define AFIO_EXTI_CFG3_EXTI8_PC14  ((uint32_t)0x0000003A) /* PC[14] pin */
#define AFIO_EXTI_CFG3_EXTI8_PD14  ((uint32_t)0x0000003B) /* PD[14] pin */
#define AFIO_EXTI_CFG3_EXTI8_PA15  ((uint32_t)0x0000003C) /* PA[15] pin */
#define AFIO_EXTI_CFG3_EXTI8_PB15  ((uint32_t)0x0000003D) /* PB[15] pin */
#define AFIO_EXTI_CFG3_EXTI8_PC15  ((uint32_t)0x0000003E) /* PC[15] pin */
#define AFIO_EXTI_CFG3_EXTI8_PD15  ((uint32_t)0x0000003F) /* PD[15] pin */

/** EXTI9 configuration **/
#define AFIO_EXTI_CFG3_EXTI9_PA0   ((uint32_t)0x00000000) /* PA[0] pin */
#define AFIO_EXTI_CFG3_EXTI9_PB0   ((uint32_t)0x00000100) /* PB[0] pin */
#define AFIO_EXTI_CFG3_EXTI9_PD0   ((uint32_t)0x00000300) /* PD[0] pin */
#define AFIO_EXTI_CFG3_EXTI9_PA1   ((uint32_t)0x00000400) /* PA[1] pin */
#define AFIO_EXTI_CFG3_EXTI9_PB1   ((uint32_t)0x00000500) /* PB[1] pin */
#define AFIO_EXTI_CFG3_EXTI9_PA2   ((uint32_t)0x00000800) /* PA[2] pin */
#define AFIO_EXTI_CFG3_EXTI9_PB2   ((uint32_t)0x00000900) /* PB[2] pin */
#define AFIO_EXTI_CFG3_EXTI9_PA3   ((uint32_t)0x00000C00) /* PA[3] pin */
#define AFIO_EXTI_CFG3_EXTI9_PB3   ((uint32_t)0x00000D00) /* PB[3] pin */
#define AFIO_EXTI_CFG3_EXTI9_PA4   ((uint32_t)0x00001000) /* PA[4] pin */
#define AFIO_EXTI_CFG3_EXTI9_PB4   ((uint32_t)0x00001100) /* PB[4] pin */
#define AFIO_EXTI_CFG3_EXTI9_PA5   ((uint32_t)0x00001400) /* PA[5] pin */
#define AFIO_EXTI_CFG3_EXTI9_PB5   ((uint32_t)0x00001500) /* PB[5] pin */
#define AFIO_EXTI_CFG3_EXTI9_PA6   ((uint32_t)0x00001800) /* PA[6] pin */
#define AFIO_EXTI_CFG3_EXTI9_PB6   ((uint32_t)0x00001900) /* PB[6] pin */
#define AFIO_EXTI_CFG3_EXTI9_PA7   ((uint32_t)0x00001C00) /* PA[7] pin */
#define AFIO_EXTI_CFG3_EXTI9_PB7   ((uint32_t)0x00001D00) /* PB[7] pin */
#define AFIO_EXTI_CFG3_EXTI9_PA8   ((uint32_t)0x00002000) /* PA[8] pin */
#define AFIO_EXTI_CFG3_EXTI9_PB8   ((uint32_t)0x00002100) /* PB[8] pin */
#define AFIO_EXTI_CFG3_EXTI9_PA9   ((uint32_t)0x00002400) /* PA[9] pin */
#define AFIO_EXTI_CFG3_EXTI9_PB9   ((uint32_t)0x00002500) /* PB[9] pin */
#define AFIO_EXTI_CFG3_EXTI9_PA10  ((uint32_t)0x00002800) /* PA[10] pin */
#define AFIO_EXTI_CFG3_EXTI9_PB10  ((uint32_t)0x00002900) /* PB[10] pin */
#define AFIO_EXTI_CFG3_EXTI9_PA11  ((uint32_t)0x00002C00) /* PA[11] pin */
#define AFIO_EXTI_CFG3_EXTI9_PB11  ((uint32_t)0x00002D00) /* PB[11] pin */
#define AFIO_EXTI_CFG3_EXTI9_PA12  ((uint32_t)0x00003000) /* PA[12] pin */
#define AFIO_EXTI_CFG3_EXTI9_PB12  ((uint32_t)0x00003100) /* PB[12] pin */
#define AFIO_EXTI_CFG3_EXTI9_PD12  ((uint32_t)0x00003300) /* PD[12] pin */
#define AFIO_EXTI_CFG3_EXTI9_PA13  ((uint32_t)0x00003400) /* PA[13] pin */
#define AFIO_EXTI_CFG3_EXTI9_PB13  ((uint32_t)0x00003500) /* PB[13] pin */
#define AFIO_EXTI_CFG3_EXTI9_PC13  ((uint32_t)0x00003600) /* PC[13] pin */
#define AFIO_EXTI_CFG3_EXTI9_PD13  ((uint32_t)0x00003700) /* PD[13] pin */
#define AFIO_EXTI_CFG3_EXTI9_PA14  ((uint32_t)0x00003800) /* PA[14] pin */
#define AFIO_EXTI_CFG3_EXTI9_PB14  ((uint32_t)0x00003900) /* PB[14] pin */
#define AFIO_EXTI_CFG3_EXTI9_PC14  ((uint32_t)0x00003A00) /* PC[14] pin */
#define AFIO_EXTI_CFG3_EXTI9_PD14  ((uint32_t)0x00003B00) /* PD[14] pin */
#define AFIO_EXTI_CFG3_EXTI9_PA15  ((uint32_t)0x00003C00) /* PA[15] pin */
#define AFIO_EXTI_CFG3_EXTI9_PB15  ((uint32_t)0x00003D00) /* PB[15] pin */
#define AFIO_EXTI_CFG3_EXTI9_PC15  ((uint32_t)0x00003E00) /* PC[15] pin */
#define AFIO_EXTI_CFG3_EXTI9_PD15  ((uint32_t)0x00003F00) /* PD[15] pin */

/** EXTI10 configuration **/
#define AFIO_EXTI_CFG3_EXTI10_PA0  ((uint32_t)0x00000000) /* PA[0] pin */
#define AFIO_EXTI_CFG3_EXTI10_PB0  ((uint32_t)0x00010000) /* PB[0] pin */
#define AFIO_EXTI_CFG3_EXTI10_PD0  ((uint32_t)0x00030000) /* PD[0] pin */
#define AFIO_EXTI_CFG3_EXTI10_PA1  ((uint32_t)0x00040000) /* PA[1] pin */
#define AFIO_EXTI_CFG3_EXTI10_PB1  ((uint32_t)0x00050000) /* PB[1] pin */
#define AFIO_EXTI_CFG3_EXTI10_PA2  ((uint32_t)0x00080000) /* PA[2] pin */
#define AFIO_EXTI_CFG3_EXTI10_PB2  ((uint32_t)0x00090000) /* PB[2] pin */
#define AFIO_EXTI_CFG3_EXTI10_PA3  ((uint32_t)0x000C0000) /* PA[3] pin */
#define AFIO_EXTI_CFG3_EXTI10_PB3  ((uint32_t)0x000D0000) /* PB[3] pin */
#define AFIO_EXTI_CFG3_EXTI10_PA4  ((uint32_t)0x00100000) /* PA[4] pin */
#define AFIO_EXTI_CFG3_EXTI10_PB4  ((uint32_t)0x00110000) /* PB[4] pin */
#define AFIO_EXTI_CFG3_EXTI10_PA5  ((uint32_t)0x00140000) /* PA[5] pin */
#define AFIO_EXTI_CFG3_EXTI10_PB5  ((uint32_t)0x00150000) /* PB[5] pin */
#define AFIO_EXTI_CFG3_EXTI10_PA6  ((uint32_t)0x00180000) /* PA[6] pin */
#define AFIO_EXTI_CFG3_EXTI10_PB6  ((uint32_t)0x00190000) /* PB[6] pin */
#define AFIO_EXTI_CFG3_EXTI10_PA7  ((uint32_t)0x001C0000) /* PA[7] pin */
#define AFIO_EXTI_CFG3_EXTI10_PB7  ((uint32_t)0x001D0000) /* PB[7] pin */
#define AFIO_EXTI_CFG3_EXTI10_PA8  ((uint32_t)0x00200000) /* PA[8] pin */
#define AFIO_EXTI_CFG3_EXTI10_PB8  ((uint32_t)0x00210000) /* PB[8] pin */
#define AFIO_EXTI_CFG3_EXTI10_PA9  ((uint32_t)0x00240000) /* PA[9] pin */
#define AFIO_EXTI_CFG3_EXTI10_PB9  ((uint32_t)0x00250000) /* PB[9] pin */
#define AFIO_EXTI_CFG3_EXTI10_PA10 ((uint32_t)0x00280000) /* PA[10] pin */
#define AFIO_EXTI_CFG3_EXTI10_PB10 ((uint32_t)0x00290000) /* PB[10] pin */
#define AFIO_EXTI_CFG3_EXTI10_PA11 ((uint32_t)0x002C0000) /* PA[11] pin */
#define AFIO_EXTI_CFG3_EXTI10_PB11 ((uint32_t)0x002D0000) /* PB[11] pin */
#define AFIO_EXTI_CFG3_EXTI10_PA12 ((uint32_t)0x00300000) /* PA[12] pin */
#define AFIO_EXTI_CFG3_EXTI10_PB12 ((uint32_t)0x00310000) /* PB[12] pin */
#define AFIO_EXTI_CFG3_EXTI10_PD12 ((uint32_t)0x00330000) /* PD[12] pin */
#define AFIO_EXTI_CFG3_EXTI10_PA13 ((uint32_t)0x00340000) /* PA[13] pin */
#define AFIO_EXTI_CFG3_EXTI10_PB13 ((uint32_t)0x00350000) /* PB[13] pin */
#define AFIO_EXTI_CFG3_EXTI10_PC13 ((uint32_t)0x00360000) /* PC[13] pin */
#define AFIO_EXTI_CFG3_EXTI10_PD13 ((uint32_t)0x00370000) /* PD[13] pin */
#define AFIO_EXTI_CFG3_EXTI10_PA14 ((uint32_t)0x00380000) /* PA[14] pin */
#define AFIO_EXTI_CFG3_EXTI10_PB14 ((uint32_t)0x00390000) /* PB[14] pin */
#define AFIO_EXTI_CFG3_EXTI10_PC14 ((uint32_t)0x003A0000) /* PC[14] pin */
#define AFIO_EXTI_CFG3_EXTI10_PD14 ((uint32_t)0x003B0000) /* PD[14] pin */
#define AFIO_EXTI_CFG3_EXTI10_PA15 ((uint32_t)0x003C0000) /* PA[15] pin */
#define AFIO_EXTI_CFG3_EXTI10_PB15 ((uint32_t)0x003D0000) /* PB[15] pin */
#define AFIO_EXTI_CFG3_EXTI10_PC15 ((uint32_t)0x003E0000) /* PC[15] pin */
#define AFIO_EXTI_CFG3_EXTI10_PD15 ((uint32_t)0x003F0000) /* PD[15] pin */

